
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВидимостьКнопкиПодтвердить();
	
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ОбъектПриИзменении(Элемент)
	
	ВидимостьКнопкиПодтвердить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПрикрепленПриИзменении(Элемент)
	
	ВидимостьКнопкиПодтвердить();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗавершенаПриИзменении(Элемент)
	
	ВидимостьКнопкиПодтвердить();
	
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ОткрытьДокумент(Команда)
	
	Если Запись.НаКлиенте Тогда
		
		ЗапуститьПриложение(Запись.ИмяФайла);
		
	Иначе
		
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Файл хранится на сервере, в данный момент функция открытия такого файла недоступна";
		СообщениеПользователю.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьИПрикрепить(Команда)
	
	Если Запись.НаКлиенте Тогда
				
		АдресХранилища = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(Запись.ИмяФайла));
				
	Иначе
				
		АдресХранилища = "";
				
	КонецЕсли;	
	
	ПодтвердитьИПрикрепитьНаСервере(АдресХранилища);
	
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ВидимостьКнопкиПодтвердить()

	Элементы.ПодтвердитьИПрикрепить.Видимость = НЕ Запись.Объект.Пустая() И (НЕ Запись.Прикреплен ИЛИ НЕ Запись.ОбработкаЗавершена);
	
КонецПроцедуры

&НаСервере
Процедура ПодтвердитьИПрикрепитьНаСервере(АдресХранилища)
	
	ПС_ИндексацияФайловВызовСервера.ПрикрепитьСканДокументаНаСервере(Запись, АдресХранилища);
	
	Если Запись.Прикреплен Тогда
		
		Записать();
		
		ПС_ИндексацияФайловВызовСервера.ЗавершитьОбработкуДокументаНаСервере(Запись);
		
		Если Запись.ОбработкаЗавершена Тогда
		
			Записать();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

