
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Документ") Тогда
	
		Отчет.ОбъектАнализа = Параметры.Документ;		
		СфромироватьОтчетНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура СфромироватьОтчет(Команда)
	СфромироватьОтчетНаСервере();
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура СфромироватьОтчетНаСервере()

	ТоварыДляАнализа = ПолучитьДанныеТоваров(Отчет.ОбъектАнализа);
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	
	ОтчетОбъект.ВывестиОтчет(РезультатОтчета, ТоварыДляАнализа, ДанныеРасшифровкиАдрес, УникальныйИдентификатор);	

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеТоваров(ОбъектАнализа)
	
	//Пока что предполагаем, что в документе есть табличная часть "товары" и реквизиты "Номенклатура" и "Цена"
	//Это по крайней мере так для УТ и БП для ключевых документов, если будет нужна бОльшая универсальность
	//будем пересматриватть данный подход
	
	//@skip-check reading-attribute-from-database
	ТаблицаТоваров = ОбъектАнализа.Товары.Выгрузить();
		
	ПодготовленныеТовары = Новый ТаблицаЗначений;
	ПодготовленныеТовары.Колонки.Добавить("Номенклатура");
	ПодготовленныеТовары.Колонки.Добавить("Цена");
	
	Для каждого СтрокаТЧ Из ТаблицаТоваров Цикл
		
		НоваяСтрока = ПодготовленныеТовары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
		
	КонецЦикла;
	
	Возврат ПодготовленныеТовары;		
		
КонецФункции
#КонецОбласти

