
#Область ОписаниеПеременных
&НаКлиенте
Перем ПараметрыОбработчикаОжидания;

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Документ") Тогда
	
		Отчет.ОбъектАнализа = Параметры.Документ;		
		ФормироватьПриОткрытии = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ФормироватьПриОткрытии Тогда
	
		СформироватьОтчетВФоне()
		
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура РезультатОтчетаОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	Если ТипЗнч(Расшифровка) = Тип("Строка") Тогда
		
		Если СтрНайти(Расшифровка, "http") > 0 Тогда
		
			ЗапуститьПриложение(Расшифровка);
			СтандартнаяОбработка = Ложь;
		
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура СфромироватьОтчет(Команда)
	
	//СфромироватьОтчетНаСервере();
	СформироватьОтчетВФоне();
	
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции


&НаКлиенте
Процедура СформироватьОтчетВФоне()
	
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.РезультатОтчета, "ФОРМИРОВАНИЕОТЧЕТА");
		
	ОтключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания");
	
	ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
	
	ИнтервалПроверки = ПараметрыОбработчикаОжидания.ТекущийИнтервал;
	
	Состояние(НСтр("ru = 'Выполнение отчета...'"));
	
	СформироватьОтчетВФонеДлительныеОперацииНаСервере();
	
	Если НЕ Выполнено Тогда
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", ИнтервалПроверки, Истина);
	Иначе
		ОтключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания");
		ЗагрузитьПодготовленныеДанные();
		
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СфромироватьОтчетНаСервере()

	ТоварыДляАнализа = ПолучитьДанныеТоваров(Отчет.ОбъектАнализа);
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	
	ОтчетОбъект.ВывестиОтчет(РезультатОтчета, ТоварыДляАнализа, ДанныеРасшифровкиАдрес, УникальныйИдентификатор);	

КонецПроцедуры

&НаСервере
Процедура СформироватьОтчетВФонеДлительныеОперацииНаСервере()
	
	ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторЗадания);
		
	ИдентификаторЗадания 	= Неопределено;
	Выполнено 				= Ложь;
	АдресХранилища 			= ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	
	ОтчетОбъект	= РеквизитФормыВЗначение("Отчет");
	
	ПараметрыКоманды = Новый Структура;
	ПараметрыКоманды.Вставить("АдресХранилища"         			, АдресХранилища);
	ПараметрыКоманды.Вставить("СопровождающийТекст"				, НСтр("ru = 'Выполнение отчета...'"));
	ПараметрыКоманды.Вставить("ИдентификаторКоманды"			, "СформироватьОтчет");
	ПараметрыКоманды.Вставить("УникальныйИдентификатор"         , УникальныйИдентификатор);
	ПараметрыКоманды.Вставить("СхемаКомпоновкиДанных"			, ОтчетОбъект.СхемаКомпоновкиДанных);	
	ПараметрыКоманды.Вставить("НастройкиПользователя"			, Отчет.КомпоновщикНастроек.ПользовательскиеНастройки);	
	ПараметрыКоманды.Вставить("Настройки"						, Отчет.КомпоновщикНастроек.Настройки);	
	ПараметрыКоманды.Вставить("ДанныеРасшифровки"				, ДанныеРасшифровки);
	ПараметрыКоманды.Вставить("ЭтаФормаУникальныйИдентификатор"	, ЭтаФорма.УникальныйИдентификатор);

	
	//ОбработкаОбъект.ВывестиОтчет(РезультатОтчета, ДанныеРасшифровкиАдрес, ЭтаФорма.УникальныйИдентификатор,ПраваНаПросмотрОтчета);
	
	Попытка
		
		ЗаданиеРезультат = ДлительныеОперации.ЗапуститьВыполнениеВФоне(
			УникальныйИдентификатор,
			"ДополнительныеОтчетыИОбработки.ВыполнитьКоманду",
			ПараметрыКоманды,
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Выполнение дополнительного отчета или обработки ""%1"", имя команды ""%2""'"),
				Строка(ПараметрыКоманды.ДополнительнаяОбработкаСсылка),
				ПараметрыКоманды.ИдентификаторКоманды));
		
		Выполнено = ЗаданиеРезультат.ЗаданиеВыполнено;
		ВызваноИсключение = Ложь;
		
		Если Выполнено Тогда
			ЗагрузитьПодготовленныеДанные();
		Иначе
			ИдентификаторЗадания  = ЗаданиеРезультат.ИдентификаторЗадания;
		КонецЕсли;
		
	Исключение
		
		Выполнено = Ложь;
		ВызваноИсключение = Истина;
		ТекстОшибки = ИнформацияОбОшибке();
		
	КонецПопытки;
	
		
КонецПроцедуры


&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()
	
	Попытка
		Если ЗаданиеВыполнено(ИдентификаторЗадания) Тогда 

			ЗагрузитьПодготовленныеДанные();
			ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.РезультатОтчета, "НеИспользовать");    
					
		Иначе
			ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
			ПодключитьОбработчикОжидания(
				"Подключаемый_ПроверитьВыполнениеЗадания", 
				ПараметрыОбработчикаОжидания.ТекущийИнтервал, 
				Истина);
		КонецЕсли;
	Исключение
		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.РезультатОтчета, "НеИспользовать");
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьПодготовленныеДанныеНаКлиенте()
	
	ЗагрузитьПодготовленныеДанные();
		
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьПодготовленныеДанные()

	РезультатВыполнения = ПолучитьИзВременногоХранилища(АдресХранилища);	
	
	РезультатОтчета = РезультатВыполнения.Результат;
	
	ДанныеРасшифровкиАдрес = ПоместитьВоВременноеХранилище(РезультатВыполнения.ДанныеРасшифровки, ЭтаФорма.УникальныйИдентификатор);
	
	ИдентификаторЗадания = Неопределено;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.Результат, "НеИспользовать");
	
	ОкончаниеФормирования = ТекущаяДата();
	//ВремяФормирования = "Сформирован за " + Строка(ОкончаниеФормирования - НачалоФормирования) + " сек.";
	
	//ДополнительныеСвойства = Отчет.КомпоновщикНастроек.Настройки.ДополнительныеСвойства;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаданиеВыполнено(ИдентификаторЗадания)
	
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
	
КонецФункции




&НаСервереБезКонтекста
Функция ПолучитьДанныеТоваров(ОбъектАнализа)
	
	//Пока что предполагаем, что в документе есть табличная часть "товары" и реквизиты "Номенклатура" и "Цена"
	//Это по крайней мере так для УТ и БП для ключевых документов, если будет нужна бОльшая универсальность
	//будем пересматриватть данный подход
	
	//@skip-check reading-attribute-from-database
	ТаблицаТоваров = ОбъектАнализа.Товары.Выгрузить();
		
	ПодготовленныеТовары = Новый ТаблицаЗначений;
	ПодготовленныеТовары.Колонки.Добавить("Номенклатура");
	ПодготовленныеТовары.Колонки.Добавить("Цена");
	
	Для каждого СтрокаТЧ Из ТаблицаТоваров Цикл
		
		НоваяСтрока = ПодготовленныеТовары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
		
	КонецЦикла;
	
	Возврат ПодготовленныеТовары;		
		
КонецФункции
#КонецОбласти

