
#Область ОписаниеПеременных
&НаКлиенте
Перем ПараметрыОбработчикаОжидания;

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Документ") Тогда
	
		Отчет.ОбъектАнализа = Параметры.Документ;		
		ФормироватьПриОткрытии = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ФормироватьПриОткрытии Тогда
	
		СформироватьОтчетВФоне()
		
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура РезультатОтчетаОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	
	Если ТипЗнч(Расшифровка) = Тип("Строка") Тогда
		
		Если СтрНайти(Расшифровка, "http") > 0 Тогда
		
			ЗапуститьПриложение(Расшифровка);
			СтандартнаяОбработка = Ложь;
		
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура СфромироватьОтчет(Команда)
	
	Если Отладка Тогда
	
		СфромироватьОтчетНаСервере();
		
	Иначе
		
		СформироватьОтчетВФоне();
		
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СформироватьОтчетВФоне()
	
	ДокументВОчереди = ПС_N8NВызовСервера.ЕстьОчередьКонкурентногоАнализа();

	Если ДокументВОчереди = Неопределено Тогда
	
		 ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.РезультатОтчета, "ФОРМИРОВАНИЕОТЧЕТА");
	     ДлительнаяОперация = НачатьВыполнениеНаСервере();
	     ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультат", ЭтотОбъект);
	     ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	     ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
			
		Состояние(НСтр("ru = 'Выполнение отчета...'"));

	Иначе
		
		ПС_ОбщегоНазначенияВызовСервера.СообщитьПользователю("Другой документ " + ДокументВОчереди + " находится в обработкне, попробуйте позже. Это ограничение пробного периода.");
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьРезультат(Результат, ДополнительныеПараметры) Экспорт
     
     Если Результат = Неопределено Тогда
      
      	Возврат;
      	
     КонецЕсли;
     
     Если Результат.Статус = "Ошибка" Тогда
     	
      	СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
      	Возврат;
      	
     КонецЕсли;
     
     ЗагрузитьПодготовленныеДанные(Результат.АдресРезультата);
     
КонецПроцедуры 

&НаСервере
Функция НачатьВыполнениеНаСервере()

     ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
     
     ТоварыДляАнализа = ПолучитьДанныеТоваров(Отчет.ОбъектАнализа);
     
     Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, 
     "Отчеты.ПС_КонкурентнаяРазведка.СформироватьОтчетВФоне", 
     ТоварыДляАнализа, УникальныйИдентификатор, Отчет.ОбъектАнализа);
    
КонецФункции

&НаСервере
Процедура ЗагрузитьПодготовленныеДанные(АдресРезультата)

		РезультатЗадания = ПолучитьИзВременногоХранилища(АдресРезультата);	
		
	
		РезультатОтчета = РезультатЗадания.Результат; //Это табличный документ

		ДанныеРасшифровкиАдрес = ПоместитьВоВременноеХранилище(РезультатЗадания.ДанныеРасшифровки, ЭтаФорма.УникальныйИдентификатор);

		ИдентификаторЗадания = Неопределено;

		ОбщегоНазначенияКлиентСервер.УстановитьСостояниеПоляТабличногоДокумента(Элементы.РезультатОтчета, "НеИспользовать");

		ОкончаниеФормирования = ТекущаяДатаСеанса();	
		
		Если ЗначениеЗаполнено(РезультатЗадания.ТекстОшибки) Тогда
			
			Если ПС_ИндексацияФайловВызовСервера.ПолучитьНастройкуРаспознавания("РежимТестированияСервиса") = Истина Тогда
				
				ПС_ОбщегоНазначенияВызовСервера.СообщитьПользователю(РезультатЗадания.ТекстОшибки);
				
			Иначе
				
				ПС_ОбщегоНазначенияВызовСервера.СообщитьПользователю("Не удалось выполнить запрос к ИИ, попробуйте ещё раз позже иди обратитесь к администратору");
				
			КонецЕсли;	
					
		КонецЕсли;	

КонецПроцедуры

&НаСервере
Процедура СфромироватьОтчетНаСервере()

	ДокументВОчереди = ПС_N8NВызовСервера.ЕстьОчередьКонкурентногоАнализа();

	Если ДокументВОчереди = Неопределено Тогда

		ТоварыДляАнализа = ПолучитьДанныеТоваров(Отчет.ОбъектАнализа);
		
		ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
		
		ОтчетОбъект.ВывестиОтчет(РезультатОтчета, ТоварыДляАнализа, ДанныеРасшифровкиАдрес, УникальныйИдентификатор);	

	Иначе
		
		ПС_ОбщегоНазначенияВызовСервера.СообщитьПользователю("Другой документ " + ДокументВОчереди + " находится в обработкне, попробуйте позже. Это ограничение пробного периода.");
		
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеТоваров(ОбъектАнализа)
	
	//Пока что предполагаем, что в документе есть табличная часть "товары" и реквизиты "Номенклатура" и "Цена"
	//Это по крайней мере так для УТ и БП для ключевых документов, если будет нужна бОльшая универсальность
	//будем пересматриватть данный подход
	
	//@skip-check reading-attribute-from-database
	ТаблицаТоваров = ОбъектАнализа.Товары.Выгрузить();
		
	ПодготовленныеТовары = Новый ТаблицаЗначений;
	ПодготовленныеТовары.Колонки.Добавить("Номенклатура");
	ПодготовленныеТовары.Колонки.Добавить("Цена");
	
	Для каждого СтрокаТЧ Из ТаблицаТоваров Цикл
		
		НоваяСтрока = ПодготовленныеТовары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
		
	КонецЦикла;
	
	Возврат ПодготовленныеТовары;		
		
КонецФункции
#КонецОбласти

