
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Предопределенный Тогда
		
		Элементы.Наименование.ТолькоПросмотр = Истина;
		
	КонецЕсли;
	
	Если Объект.Ссылка = Справочники.ПС_НастройкиРаспознавания.ПарольN8N Тогда
		
		Элементы.Значение.Видимость = Ложь;
		Элементы.Пароль.Видимость = Истина;
		
	Иначе
		
		Элементы.Значение.Видимость = Истина;
		Элементы.Пароль.Видимость = Ложь;
				
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти


//#Область ОбработчикиСобытийЭлементовШапкиФормы
//
//// Код процедур и функций
//
//#КонецОбласти
//
//#Область ОбработчикиКомандФормы
//
//// Код процедур и функций
//
//#КонецОбласти
//
//#Область СлужебныеПроцедурыИФункции
//
//// Код процедур и функций
//
//#КонецОбласти
