#Если ТонкийКлиент Тогда

#Область ПрограммныйИнтерфейс

// Добавляет выбранный файл на клиенте в регистр
// Параметры:
//  ВыбранныйФайл - Строка - путь к файлу
//  РасширениеФайла - Строка - расширение файла
//  СвязанныйОбъект - СправочникСсылка - связанный объект
// Возвращаемое значение:
//  СправочникСсылка - ссылка на добавленный файл
Функция ДобавитьВыбранныйФайлНаКлиентеВРегистр(ВыбранныйФайл, РасширениеФайла, СвязанныйОбъект = Неопределено) Экспорт
		
	ФайлСкана = Новый Файл(ВыбранныйФайл);
		
	Если НЕ ФайлСкана.Существует() Тогда
			
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Файл не существует";
		Сообщение.Сообщить();
		Возврат Неопределено;
			
	КонецЕсли;
				
	ХешСумма = Неопределено;			
					
	Если ПС_ИндексацияФайловВызовСервера.ЭтоИзображениеИлиPDF(РасширениеФайла) Тогда
	
		АдресВременногоХранилища = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ВыбранныйФайл));
	
		ХешСумма = ПС_ИндексацияФайловВызовСервера.ПолучитьХешСуммуФайла(АдресВременногоХранилища);
		
		РанееЗагруженныйИД = Неопределено;
		
		//Если уже есть запись в регистре с таким хешом и с временным ИД, не привязанным к документу, поменяем ИД, запись добавлять не будем
		Если ТипЗнч(СвязанныйОбъект) = Тип("Строка") Тогда
			
			РанееЗагруженныйИД = ПС_ИндексацияФайловВызовСервера.ПолучитьИДВременнойЗаписиРегистраПоХешу(ХешСумма);
			
		КонецЕсли;
		
		Если РанееЗагруженныйИД = Неопределено Тогда

			ПС_ИндексацияФайловВызовСервера.ДобавитьФайлВРегистр(ВыбранныйФайл, ХешСумма, Истина, СвязанныйОбъект);
			
		Иначе
			
			СвязанныйОбъект = РанееЗагруженныйИД;
			
		КонецЕсли;

		Возврат ХешСумма;
		
	Иначе
		
		Возврат Неопределено;

	КонецЕсли;
	
КонецФункции

//Обрабатывает документ по хеш сумме
//Параметры:
//	ХешСумма - Строка - Хеш сумма файла
//	РучнойЗапуск - Булево - признак того, что обработка документа инициирована пользователем
//	ДокументИД - Строка - ИД документа, который нужно обработать
Процедура ОбработатьДокумент(ХешСумма, РучнойЗапуск = Ложь, ДокументИД = Неопределено) Экспорт

	Если ПС_ИндексацияФайловВызовСервера.ЭтоСерверLinux() Тогда

		Если ЭтоКлиентLinux() Тогда
			
			ОбработатьДокументБезОкантовки(ХешСумма);
			
		Иначе //Если сервер Linux, а клиент Win то произведем конвертацию на клиенте
		
			//Если принудительно отключена
			Если ПС_ИндексацияФайловВызовСервера.ПолучитьНастройкуРаспознавания("ИспользоватьКомпонентуОкантовки") = Истина Тогда
		
				УстановитьКомпонентуНаКлиентеИОбработатьДокумент(ХешСумма);	
		
			Иначе
		
				ОбработатьДокументБезОкантовки(ХешСумма);
				
			КонецЕсли;
			
		КонецЕсли;

	Иначе
		
		ДанныеФайла = ДанныеОдногоФайлаПоХешСумме(ХешСумма);
		
		Если ДанныеФайла <> Неопределено Тогда
		
			Если ДанныеФайла.НаКлиенте Тогда
				
				АдресХранилища = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ДанныеФайла.ИмяФайла));
				
			Иначе
				
				АдресХранилища = "";
				
			КонецЕсли;		
					
			//TODO: !!! Во всех вызовах этой функции выше нужно передавать ИД объекта, если было запущено распознавание при загрузке документа
			ПС_ИндексацияФайловВызовСервера.ОбработатьДокумент(ХешСумма, АдресХранилища, РучнойЗапуск, ДокументИД);
			
		КонецЕсли;		
		
	КонецЕсли;
	
КонецПроцедуры

//Возвращает тип ОС
//Возвращаемое значение:
//Булево
Функция ЭтоКлиентLinux() Экспорт
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Возврат СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86 ИЛИ СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86_64;
	
КонецФункции

//Перебирает файлы в каталогах сканирования и заносит в регистр
Процедура ПроверитьКаталогиСФайлами() Экспорт
	
	МассивКаталогов = ПС_ИндексацияФайловВызовСервера.ПолучитьИндексируемыеКаталоги(Истина);
	
	Для каждого ВыборкаКаталогов Из МассивКаталогов Цикл
		
		ПутьККаталогу = ВыборкаКаталогов.ПутьККаталогу;		
		КаталогНаКлиенте = Новый Файл(ПутьККаталогу);
		
		Если НЕ КаталогНаКлиенте.Существует() Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		МассивФайлов = НайтиФайлы(ПутьККаталогу, "*.*", Истина);
		
		Для Каждого Файл Из МассивФайлов Цикл
			
			Если ПС_ИндексацияФайловВызовСервера.ЭтоИзображениеИлиPDF(Файл.Расширение) Тогда
	
				АдресВременногоХранилища = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(Файл.ПолноеИмя));
	
				ХешСумма = ПС_ИндексацияФайловВызовСервера.ПолучитьХешСуммуФайла(АдресВременногоХранилища);

				ПС_ИндексацияФайловВызовСервера.ДобавитьФайлВРегистр(Файл.ПолноеИмя, ХешСумма, Истина);

			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти

//#Область СлужебныйПрограммныйИнтерфейс
//#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеОдногоФайлаПоХешСумме(ХешСумма)

	//Получаем файл
	ДанныеФайлаМассив = ПС_ИндексацияФайловВызовСервера.ПолучитьДанныеРегистраПоХешСумме(ХешСумма);
	
	Если ДанныеФайлаМассив.Количество() = 0 Тогда
		
		Возврат Неопределено;
		
	Иначе
		
		ДанныеФайла = ДанныеФайлаМассив[0];
		
	КонецЕсли;
	
	Возврат ДанныеФайла;
	
КонецФункции

Процедура УстановитьКомпонентуНаКлиентеИОбработатьДокумент(ХешСумма)
	
//Получаем компоненту конвертации
//	КаталогКомпоненты = КаталогВременныхФайлов() + "PSTools\";
//	
//	КаталогНаКлиенте = Новый Файл(КаталогКомпоненты);
//	
//	Если НЕ КаталогНаКлиенте.Существует() Тогда
//		
//		СоздатьКаталог(КаталогКомпоненты);
//		
//	КонецЕсли;
//	
//	ИмяФайлаКомпоненты = "PdfToStream.dll";
//	
//	СисИнфо = Новый СистемнаяИнформация;
//		
//	НайденныеФайлы = НайтиФайлы(КаталогКомпоненты, ИмяФайлаКомпоненты);
//	
//	Если НайденныеФайлы.Количество() = 0 Тогда
//		
//		АдресХранилищаКомпоненты = ПС_ИндексацияФайловВызовСервера.ПолучитьКомпонентыКонвертацииССервера(Строка(СисИнфо.ТипПлатформы));
//	
//		ДД_Компоненты = ПолучитьИзВременногоХранилища(АдресХранилищаКомпоненты);
//		
//		ПолноеИмяФайлаКомпоненты = КаталогКомпоненты+"\"+ИмяФайлаКомпоненты;
//		
//		ДД_Компоненты.Записать(ПолноеИмяФайлаКомпоненты);
//		
//	Иначе
//		
//		ПолноеИмяФайлаКомпоненты = НайденныеФайлы[0].ПолноеИмя;
//		
//	КонецЕсли;
	
	//На клиенте устанавливаем компоненту из макета с zip архивом, в котором хранится манифест и две версии компоненты
	
	ПолноеИмяФайлаКомпоненты = "ОбщийМакет.NativeComp_x64_distr";
	
	РезультатПодключения = ПодключитьВнешнююКомпоненту(ПолноеИмяФайлаКомпоненты,"VK",ТипВнешнейКомпоненты.Native);
	
	Если НЕ РезультатПодключения Тогда
	
		ПослеУстановкиКомпоненты = Новый ОписаниеОповещения("ПослеУстановкиКомпоненты", ЭтотОбъект, Новый Структура("ХешСумма,Компонента", ХешСумма, ПолноеИмяФайлаКомпоненты));

		НачатьУстановкуВнешнейКомпоненты(ПослеУстановкиКомпоненты, ПолноеИмяФайлаКомпоненты); 
		
	Иначе
				
		ПослеУстановкиКомпоненты(Новый Структура("ХешСумма,Компонента", ХешСумма, ПолноеИмяФайлаКомпоненты));
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПослеУстановкиКомпоненты(ДопПараметры) Экспорт
	
		НачатьПодключениеВнешнейКомпоненты(Новый ОписаниеОповещения("ПослеПодключенияКомпоненты", ЭтотОбъект, ДопПараметры), ДопПараметры.Компонента, "VK");
	
КонецПроцедуры

Процедура ПослеПодключенияКомпоненты(Подключено, ДополнительныеПараметры) Экспорт
		
		Если Подключено Тогда
	
			СконвертированныйСкан = ПолучитьСконвертированныйСканНаКлиенте(ДополнительныеПараметры.ХешСумма, ДополнительныеПараметры.Компонента);
			
			Если СконвертированныйСкан <> Неопределено Тогда
				
				АдресХранилища = ПоместитьВоВременноеХранилище(СконвертированныйСкан);
				
				ПС_ИндексацияФайловВызовСервера.ОбработатьДокумент(ДополнительныеПараметры.ХешСумма, АдресХранилища);				
					
			КонецЕсли;
			
		Иначе //Если не удалось подключить компоненту даже после установки, то отправляем на распознавание документ как есть
		
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст = "Компонента конвертации установлена, но её не удалось подключить";
			СообщениеПользователю.Сообщить();		
			
			ОбработатьДокументБезОкантовки(ДополнительныеПараметры.ХешСумма);
			
		КонецЕсли;
				
КонецПроцедуры

Процедура ОбработатьДокументБезОкантовки(ХешСумма)
	
	ДанныеФайла = ДанныеОдногоФайлаПоХешСумме(ХешСумма);		
			
	Если ДанныеФайла.НаКлиенте Тогда
			
		РезультатОбработкиФайла = Новый Структура("ДвоичныеДанныеФайлаНаКлиенте,БылаПопыткаКонвертации",
		Новый ДвоичныеДанные(ДанныеФайла.ИмяФайла), Истина);
			
		АдресХранилища = ПоместитьВоВременноеХранилище(РезультатОбработкиФайла);	
				
	Иначе
				
		АдресХранилища = "";
				
	КонецЕсли;
			
	ПС_ИндексацияФайловВызовСервера.ОбработатьДокумент(ХешСумма, АдресХранилища);
	
КонецПроцедуры

Функция ПолучитьСконвертированныйСканНаКлиенте(ХешСумма, ПолноеИмяФайлаКомпоненты)

	МассивДанных = Неопределено;

	//Получаем файл
	ДанныеФайлаМассив = ПС_ИндексацияФайловВызовСервера.ПолучитьДанныеРегистраПоХешСумме(ХешСумма);
	
	Если ДанныеФайлаМассив.Количество() = 0 Тогда
		
		Возврат Неопределено;
		
	Иначе
		
		ДанныеФайла = ДанныеФайлаМассив[0];
		
	КонецЕсли;
	
	ИмяФайла = "";
	НужноУдалитьФайл = Ложь;
	
	Если ДанныеФайла.НаКлиенте Тогда
	
		ИмяФайла = ДанныеФайла.ИмяФайла;
		
	Иначе //Возможен вариант, когда сервер Linux и мы получаем с сервера файл на клиент, чтобы добавить окантовку для лучшего распознавания
		
		ИмяФайла = ПолучитьИмяВременногоФайла();
		ПолучитьФайлССервера = ПС_ИндексацияФайловВызовСервера.ПолучитьФайлССервера(ДанныеФайла.ИмяФайла);
		ПолучитьФайлССервера.Записать(ИмяФайла);
		НужноУдалитьФайл = Истина;
		
	КонецЕсли;
	
	//РезультатПодключения = ПодключитьВнешнююКомпоненту(ПолноеИмяФайлаКомпоненты,"VK",ТипВнешнейКомпоненты.Native);
	//
	//По идее уже подключили в процедуре ПодключитьКомпонентуНаКлиенте
	//
	//Если РезультатПодключения Тогда  
	
		Компонента = Новый("AddIn.VK.PdfToStream");
		Результат = Компонента.ЗагрузитьPDF(ИмяФайла);

		Если Результат Тогда
				
			МассивДанных = Новый Массив;
			
			КоличествоСтраниц = Компонента.КоличествоСтраницВДокументе;
			
			Для Ы = 0 По КоличествоСтраниц -1 Цикл	
			
				КартинкаДокумента = Компонента.ПолучитьСтраницу(Ы);
				ТекстДокумента = Компонента.ПолучитьТекстСтраницы(Ы);
				СтруктураДанных = Новый Структура("Картинка, Текст", КартинкаДокумента, ТекстДокумента);
			
				МассивДанных.Вставить(СтруктураДанных);
				
			КонецЦикла;			

		КонецЕсли;
		
//	Иначе
//		
//		СообщениеПользователю = Новый СообщениеПользователю;
//		СообщениеПользователю.Текст = "Не удалось загрузить компоненту конвертации на клиенте";
//		СообщениеПользователю.Сообщить();
//
//	КонецЕсли;
	
	
	Если НужноУдалитьФайл Тогда
		УдалитьФайлы(ИмяФайла);
	КонецЕсли;	
	
	Возврат МассивДанных;
	
КонецФункции

#КонецОбласти

#КонецЕсли
