
#Область ПрограммныйИнтерфейс

// Создает контрагента по данным распознавания
// 
// Параметры:
//  ЗаписьРегистра - Структура - данные распознавания
// 
// Возвращаемое значение:
//  СправочникСсылка.Контрагенты - ссылка на созданный контрагент
Функция СоздатьКонтрагентаПоРаспознаннымДанным(Знач ЗаписьРегистра) Экспорт

	//Определение конфигурации
	//Определение типа документа
	//Определения модуля заполнения выбранного документа
	
	МодульСозданияДокументов = Неопределено;
	
	Если СтрНайти(ВРег(Метаданные.Имя), "ТОРГОВЛЕЙ") > 0 Тогда
		
		//Пока не предусмотрено
		
	ИначеЕсли СтрНайти(ВРег(Метаданные.Имя), "БУХГАЛТЕРИЯ") > 0 Тогда
		
		УстановитьБезопасныйРежим(Истина);
		МодульСозданияДокументов = Вычислить("ПС_СозданиеДокументовБухгалтерияПредприятия");
		УстановитьБезопасныйРежим(Ложь);
		
	КонецЕсли;
	
	Если МодульСозданияДокументов = Неопределено Тогда
		
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Автоматическое создание контрагентов в данной конфигурации не предусмотрено";
		СообщениеПользователю.Сообщить();
		Возврат Неопределено;
		
	КонецЕсли;
	
	ДанныеРаспознавания = Неопределено;
	
	Если ТипЗнч(ЗаписьРегистра) = Тип("Структура") Тогда
		
		ДанныеРаспознавания = ЗаписьРегистра;
		
		Если НЕ ДанныеРаспознавания.Свойство("Реквизиты") Тогда
			
			ПС_ИндексацияФайловВызовСервера.СериализоватьВсеДанныеРаспознавания(ДанныеРаспознавания);
			
		КонецЕсли;
		
	Иначе
		
		ДанныеРаспознавания = ПС_ИндексацияФайловВызовСервера.ДанныеОдногоФайлаПоХешСумме(ЗаписьРегистра.ХешСумма, ЗаписьРегистра.Объект);
		ПС_ИндексацияФайловВызовСервера.СериализоватьВсеДанныеРаспознавания(ДанныеРаспознавания);
		
	КонецЕсли;
	
	Если ДанныеРаспознавания.Распознан Тогда
	
		Возврат МодульСозданияДокументов.СоздатьКонтрагента(ДанныеРаспознавания);	
		
	Иначе
		
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Документ не распознан";
		СообщениеПользователю.Сообщить();
		Возврат Неопределено;
				
	КонецЕсли;
	
КонецФункции

// Возвращает настройки загрузки документа по ОКУД
//
// Параметры:
//  ОКУД - Строка - ОКУД документа
//
// Возвращаемое значение:
//  Структура, Неопределено - настройки загрузки документа
Функция ПолучитьНастройкиЗагрузкиДокумента(ОКУД) Экспорт
	
	Если ПустаяСтрока(ОКУД) Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	ЗапросНастроек = Новый Запрос();
	ЗапросНастроек.Текст = "ВЫБРАТЬ
	|	ПС_ОсобенностиЗагрузкиФормДокументов.Ссылка КАК Ссылка,
	|	ПС_ОсобенностиЗагрузкиФормДокументов.ВариантЗагрузкиСтрок КАК ВариантЗагрузкиСтрок,
	|	ПС_ОсобенностиЗагрузкиФормДокументов.ВДокументеВсегдаУслуги КАК ВДокументеВсегдаУслуги,
	|	ПС_ОсобенностиЗагрузкиФормДокументов.НоменклатураДляУслугПоУмолчанию КАК НоменклатураДляУслугПоУмолчанию,
	|	ПС_ОсобенностиЗагрузкиФормДокументов.ПриоритетныйВариантИдентификацииСторон КАК
	|		ПриоритетныйВариантИдентификацииСторон,
	|	ПС_ОсобенностиЗагрузкиФормДокументов.СоздаватьКонтрагентовАвтоматическиПриЗагрузке КАК
	|		СоздаватьКонтрагентовАвтоматическиПриЗагрузке,
	|	ПС_ОсобенностиЗагрузкиФормДокументов.ОКУД КАК ОКУД
	|ИЗ
	|	Справочник.ПС_ОсобенностиЗагрузкиФормДокументов КАК ПС_ОсобенностиЗагрузкиФормДокументов
	|ГДЕ
	|	ПС_ОсобенностиЗагрузкиФормДокументов.ОКУД ПОДОБНО &ОКУД";
	
	ЗапросНастроек.Параметры.Вставить("ОКУД", "%" + ОКУД + "%");
	
	ТаблицаРезультат = ЗапросНастроек.Выполнить().Выгрузить();
	
	Если ТаблицаРезультат.Количество() > 0 Тогда
	
		Для каждого ТекСтрокаНастроек Из ТаблицаРезультат Цикл
		
			МассивОКУД = СтрРазделить(ТекСтрокаНастроек.ОКУД, ",");
			
			Если МассивОКУД.Найти(ОКУД) <> Неопределено Тогда
	
				СтруктураРезультат = Новый Структура;
				
				Для каждого ТекКолонка Из ТаблицаРезультат.Колонки Цикл
				
					СтруктураРезультат.Вставить(ТекКолонка.Имя, ТекСтрокаНастроек[ТекКолонка.Имя]);
					
				КонецЦикла;
				
				Возврат СтруктураРезультат;
				
			КонецЕсли;
			
		КонецЦикла;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

// Создает документ по распознанным данным
// Параметры:
//	ХешСумма - Строка - Хеш сумма файла
//	Идентификатор - Строка - Идентификатор файла
//	ДополнительныеПараметры - Структура - Дополнительные параметры
//	ОбновитьДокумент - Булево - Признак обновления документа
// Возвращаемое значение:
//	ДокументСсылка - Документ по распознанным данным
Функция СоздатьДокументПоРаспознаннымДанным(ХешСумма, Идентификатор, ДополнительныеПараметры, ОбновитьДокумент = Ложь) Экспорт

	//Определение конфигурации
	//Определение типа документа
	//Определения модуля заполнения выбранного документа
	
	
	МодульСозданияДокументов = Неопределено;
	
	Если СтрНайти(ВРег(Метаданные.Имя), "ТОРГОВЛЕЙ") > 0 Тогда
		
		//Пока не предусмотрено
		
	ИначеЕсли СтрНайти(ВРег(Метаданные.Имя), "БУХГАЛТЕРИЯ") > 0 Тогда
		
		УстановитьБезопасныйРежим(Истина);
		МодульСозданияДокументов = Вычислить("ПС_СозданиеДокументовБухгалтерияПредприятия");
		УстановитьБезопасныйРежим(Ложь);
		
	КонецЕсли;
	
	Если МодульСозданияДокументов = Неопределено Тогда
		
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Автоматическое создание документов в данной конфигурации не предусмотрено";
		СообщениеПользователю.Сообщить();
		Возврат Неопределено;
		
	КонецЕсли;
	
	ДанныеРаспознавания = ПС_ИндексацияФайловВызовСервера.ДанныеОдногоФайлаПоХешСумме(ХешСумма, Идентификатор);
	
	Если ДанныеРаспознавания = Неопределено Тогда
		
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Не удалось получить данные распознавания";
		СообщениеПользователю.Сообщить();
		Возврат Неопределено;
		
	КонецЕсли;

	
	СтруктураКлючевыхРеквизитов = ПС_ИндексацияФайловВызовСервера.JSONВСтруктуру(ДанныеРаспознавания.КлючевыеРеквизиты);
	
	СоздаватьКонтрагентаАвтоматически = ПС_ИндексацияФайловВызовСервера.ПолучитьНастройкуРаспознавания("СоздаватьКонтрагентовАвтоматическиПриЗагрузке") = Истина;
		
	Если ЗначениеЗаполнено(СтруктураКлючевыхРеквизитов.OKUD) Тогда
		
		НастройкиЗагрузки = ПолучитьНастройкиЗагрузкиДокумента(СтруктураКлючевыхРеквизитов.OKUD);
		
	КонецЕсли;	
	
	Если НастройкиЗагрузки <> Неопределено Тогда
		
		СоздаватьКонтрагентаАвтоматически = НастройкиЗагрузки.СоздаватьКонтрагентовАвтоматическиПриЗагрузке;
		
	КонецЕсли;

	ПС_ИндексацияФайловВызовСервера.СериализоватьВсеДанныеРаспознавания(ДанныеРаспознавания);
	
	Если НЕ ЗначениеЗаполнено(ДанныеРаспознавания.Контрагент) И СоздаватьКонтрагентаАвтоматически Тогда
			
		Контрагент = СоздатьКонтрагентаПоРаспознаннымДанным(ДанныеРаспознавания);
		
		ДанныеРаспознавания.Контрагент = Контрагент;
		
		МенеджерЗаписи = РегистрыСведений.ПС_ОбработкаДокументов.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ХешСумма = ХешСумма;
		МенеджерЗаписи.Объект = Идентификатор;
		МенеджерЗаписи.Прочитать();
		
		Если МенеджерЗаписи.Выбран() Тогда
			
			МенеджерЗаписи.Контрагент = Контрагент;
			МенеджерЗаписи.Записать();
			
		КонецЕсли;
			
	КонецЕсли;
	
	Если ДанныеРаспознавания.Распознан Тогда
	
		Возврат МодульСозданияДокументов.СоздатьДокумент(ДанныеРаспознавания, ДополнительныеПараметры, ОбновитьДокумент);	
		
	Иначе
		
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Не удалось распознать документ";
		СообщениеПользователю.Сообщить();
		Возврат Неопределено;
				
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
