
#Область ПрограммныйИнтерфейс

// Создает контрагента по данным распознавания
// 
// Параметры:
//  ЗаписьРегистра - Структура - данные распознавания
// 
// Возвращаемое значение:
//  СправочникСсылка.Контрагенты - ссылка на созданный контрагент
Функция СоздатьКонтрагентаПоРаспознаннымДанным(Знач ЗаписьРегистра) Экспорт

	//Определение конфигурации
	//Определение типа документа
	//Определения модуля заполнения выбранного документа
	
	МодульСозданияДокументов = Неопределено;
	
	Если СтрНайти(ВРег(Метаданные.Имя), "ТОРГОВЛЕЙ") > 0 Тогда
		
		//Пока не предусмотрено
		
	ИначеЕсли СтрНайти(ВРег(Метаданные.Имя), "БУХГАЛТЕРИЯ") > 0 Тогда
		
		УстановитьБезопасныйРежим(Истина);
		МодульСозданияДокументов = Вычислить("ПС_СозданиеДокументовБухгалтерияПредприятия");
		УстановитьБезопасныйРежим(Ложь);
		
	КонецЕсли;
	
	Если МодульСозданияДокументов = Неопределено Тогда
		
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Автоматическое создание контрагентов в данной конфигурации не предусмотрено";
		СообщениеПользователю.Сообщить();
		Возврат Неопределено;
		
	КонецЕсли;
	
	ДанныеРаспознавания = ПС_ИндексацияФайловВызовСервера.ДанныеОдногоФайлаПоХешСумме(ЗаписьРегистра.ХешСумма, ЗаписьРегистра.Объект);
	
	ПС_ИндексацияФайловВызовСервера.СериализоватьВсеДанныеРаспознавания(ДанныеРаспознавания);
	
	Если ДанныеРаспознавания.Распознан Тогда
	
		Возврат МодульСозданияДокументов.СоздатьКонтрагента(ДанныеРаспознавания);	
		
	Иначе
		
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Документ не распознан";
		СообщениеПользователю.Сообщить();
		Возврат Неопределено;
				
	КонецЕсли;
	
КонецФункции

// Возвращает настройки загрузки документа по ОКУД
//
// Параметры:
//  ОКУД - Строка - ОКУД документа
//
// Возвращаемое значение:
//  Структура, Неопределено - настройки загрузки документа
Функция ПолучитьНастройкиЗагрузкиДокумента(ОКУД) Экспорт
	
	Если ПустаяСтрока(ОКУД) Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	ЗапросНастроек = Новый Запрос();
	ЗапросНастроек.Текст = "ВЫБРАТЬ
	|	ПС_ОсобенностиЗагрузкиФормДокументов.Ссылка КАК Ссылка,
	|	ПС_ОсобенностиЗагрузкиФормДокументов.ВариантЗагрузкиСтрок КАК ВариантЗагрузкиСтрок,
	|	ПС_ОсобенностиЗагрузкиФормДокументов.ВДокументеВсегдаУслуги КАК ВДокументеВсегдаУслуги,
	|	ПС_ОсобенностиЗагрузкиФормДокументов.НоменклатураДляУслугПоУмолчанию КАК НоменклатураДляУслугПоУмолчанию,
	|	ПС_ОсобенностиЗагрузкиФормДокументов.ПриоритетныйВариантИдентификацииСторон КАК
	|		ПриоритетныйВариантИдентификацииСторон,
	|	ПС_ОсобенностиЗагрузкиФормДокументов.СоздаватьКонтрагентовАвтоматическиПриЗагрузке КАК
	|		СоздаватьКонтрагентовАвтоматическиПриЗагрузке
	|ИЗ
	|	Справочник.ПС_ОсобенностиЗагрузкиФормДокументов КАК ПС_ОсобенностиЗагрузкиФормДокументов
	|ГДЕ
	|	ПС_ОсобенностиЗагрузкиФормДокументов.ОКУД = &ОКУД";
	
	ЗапросНастроек.Параметры.Вставить("ОКУД", ОКУД);
	
	ТаблицаРезультат = ЗапросНастроек.Выполнить().Выгрузить();
	
	Если ТаблицаРезультат.Количество() > 0 Тогда
	
		СтруктураРезультат = Новый Структура;
		
		ПерваяСтрока = ТаблицаРезультат[0];
		
		Для каждого ТекКолонка Из ТаблицаРезультат.Колонки Цикл
		
			СтруктураРезультат.Вставить(ТекКолонка.Имя, ПерваяСтрока[ТекКолонка.Имя]);
			
		КонецЦикла;
		
		Возврат СтруктураРезультат;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

// Создает документ по распознанным данным
// Параметры:
//	ХешСумма - Строка - Хеш сумма файла
//	Идентификатор - Строка - Идентификатор файла
//	ДополнительныеПараметры - Структура - Дополнительные параметры
//	ОбновитьДокумент - Булево - Признак обновления документа
// Возвращаемое значение:
//	ДокументСсылка - Документ по распознанным данным
Функция СоздатьДокументПоРаспознаннымДанным(ХешСумма, Идентификатор, ДополнительныеПараметры, ОбновитьДокумент = Ложь) Экспорт

	//Определение конфигурации
	//Определение типа документа
	//Определения модуля заполнения выбранного документа
	
	
	МодульСозданияДокументов = Неопределено;
	
	Если СтрНайти(ВРег(Метаданные.Имя), "ТОРГОВЛЕЙ") > 0 Тогда
		
		//Пока не предусмотрено
		
	ИначеЕсли СтрНайти(ВРег(Метаданные.Имя), "БУХГАЛТЕРИЯ") > 0 Тогда
		
		УстановитьБезопасныйРежим(Истина);
		МодульСозданияДокументов = Вычислить("ПС_СозданиеДокументовБухгалтерияПредприятия");
		УстановитьБезопасныйРежим(Ложь);
		
	КонецЕсли;
	
	Если МодульСозданияДокументов = Неопределено Тогда
		
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Автоматическое создание документов в данной конфигурации не предусмотрено";
		СообщениеПользователю.Сообщить();
		Возврат Неопределено;
		
	КонецЕсли;
	
	ДанныеРаспознавания = ПС_ИндексацияФайловВызовСервера.ДанныеОдногоФайлаПоХешСумме(ХешСумма, Идентификатор);
	
	СтруктураКлючевыхРеквизитов = ПС_ИндексацияФайловВызовСервера.JSONВСтруктуру(ДанныеРаспознавания.КлючевыеРеквизиты);
	
	СоздаватьКонтрагентаАвтоматически = ПС_ИндексацияФайловВызовСервера.ПолучитьНастройкуРаспознавания("СоздаватьКонтрагентовАвтоматическиПриЗагрузке") = Истина;
		
	Если ЗначениеЗаполнено(СтруктураКлючевыхРеквизитов.OKUD) Тогда
		
		НастройкиЗагрузки = ПолучитьНастройкиЗагрузкиДокумента(СтруктураКлючевыхРеквизитов.OKUD);
		
	КонецЕсли;	
	
	Если НастройкиЗагрузки <> Неопределено Тогда
		
		СоздаватьКонтрагентаАвтоматически = НастройкиЗагрузки.СоздаватьКонтрагентовАвтоматическиПриЗагрузке;
		
	КонецЕсли;

	ПС_ИндексацияФайловВызовСервера.СериализоватьВсеДанныеРаспознавания(ДанныеРаспознавания);
	
	Если НЕ ЗначениеЗаполнено(ДанныеРаспознавания.Контрагент) И СоздаватьКонтрагентаАвтоматически Тогда
			
		Контрагент = СоздатьКонтрагентаПоРаспознаннымДанным(ДанныеРаспознавания);
		
		//TODO: Если создан, записать в регистр			
			
	КонецЕсли;
	
	Если ДанныеРаспознавания.Распознан Тогда
	
		Возврат МодульСозданияДокументов.СоздатьДокумент(ДанныеРаспознавания, ДополнительныеПараметры);	
		
	Иначе
		
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Не удалось распознать документ";
		СообщениеПользователю.Сообщить();
		Возврат Неопределено;
				
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
