#Если ТонкийКлиент Тогда

#Область ПрограммныйИнтерфейс

//Обрабатывает документ по хеш сумме
//Параметры:
//	ХешСумма - Строка - Хеш сумма файла
Процедура ОбработатьДокумент(ХешСумма) Экспорт

	Если ПС_ИндексацияФайловВызовСервера.ЭтоСерверLinux() Тогда

		Если ЭтоКлиентLinux() Тогда
			
			//Нужно будет реализовать в дальнейшем необходимость конвертации или конвертацию средствами ИИ
			ВызватьИсключение "Распознавание документов на клиенте Linux не поддерживается.";
			
		Иначе //Если сервер Linux, то произведем конвертацию на клиенте
		
			СконвертированныйСкан = ПолучитьСконвертированныйСкан(ХешСумма);
			
		КонецЕсли;

	Иначе
		
		//!!! Распознавание на сервере Win пока не реализована
		ПС_ИндексацияФайловВызовСервера.ОбработатьДокумент(ХешСумма);
		
	КонецЕсли;
	
КонецПроцедуры

//Возвращает тип ОС
//Возвращаемое значение:
//Булево
Функция ЭтоКлиентLinux() Экспорт
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Возврат СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86 ИЛИ СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86_64;
	
КонецФункции

//Перебирает файлы в каталогах сканирования и заносит в регистр
Процедура ПроверитьКаталогиСФайлами() Экспорт
	
	МассивКаталогов = ПС_ИндексацияФайловВызовСервера.ПолучитьИндексируемыеКаталоги(Истина);
	
	Для каждого ВыборкаКаталогов Из МассивКаталогов Цикл
		
		ПутьККаталогу = ВыборкаКаталогов.ПутьККаталогу;		
		КаталогНаКлиенте = Новый Файл(ПутьККаталогу);
		
		Если НЕ КаталогНаКлиенте.Существует() Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		МассивФайлов = НайтиФайлы(ПутьККаталогу, "*.*", Истина);
		
		Для Каждого Файл Из МассивФайлов Цикл
			
			Если ПС_ИндексацияФайловВызовСервера.ЭтоИзображениеИлиPDF(Файл.Расширение) Тогда
	
				АдресВременногоХранилища = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(Файл.ПолноеИмя));
	
				ХешСумма = ПС_ИндексацияФайловВызовСервера.ПолучитьХешСуммуФайла(АдресВременногоХранилища);

				ПС_ИндексацияФайловВызовСервера.ДобавитьФайлВРегистр(Файл.ПолноеИмя, ХешСумма, Истина);

			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти

//#Область СлужебныйПрограммныйИнтерфейс
//#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСконвертированныйСкан(ХешСумма)

	ДанныеФайлаМассив = ПС_ИндексацияФайловВызовСервера.ПолучитьДанныеРегистраПоХешСумме(ХешСумма);
	
	Если ДанныеФайлаМассив.Количество() = 0 Тогда
		
		Возврат Неопределено;
		
	Иначе
		
		ДанныеФайла = ДанныеФайлаМассив[0];
		
	КонецЕсли;
	
	ИмяФайла = "";
	НужноУдалитьФайл = Ложь;
	
	Если ДанныеФайла.НаКлиенте Тогда
	
		ИмяФайла = ДанныеФайла.ИмяФайла;
		
	Иначе
		
		ИмяФайла = ПолучитьИмяВременногоФайла();
		ПолучитьФайлССервера = ПС_ИндексацияФайловВызовСервера.ПолучитьФайлССервера(ДанныеФайла.ИмяФайла);
		ПолучитьФайлССервера.Записать(ИмяФайла);
		НужноУдалитьФайл = Истина;
		
	КонецЕсли;
	
	КаталогКомпоненты = КаталогВременныхФайлов() + "PSTools\";
	
	КаталогНаКлиенте = Новый Файл(КаталогКомпоненты);
	
	Если НЕ КаталогНаКлиенте.Существует() Тогда
		
		СоздатьКаталог(КаталогКомпоненты);
		
	КонецЕсли;
	
	ИмяФайлаКомпоненты = "PdfToStream.dll";
	
	СисИнфо = Новый СистемнаяИнформация;
	
	ДД_Компоненты = ПС_ИндексацияФайловВызовСервера.ПолучитьКомпонентыКонвертацииССервера(СисИнфо.ТипПлатформы);
	
	Если НайтиФайлы(КаталогКомпоненты, ИмяФайлаКомпоненты).Количество() = 0 Тогда
		
		ПолноеИмяФайлаКомпоненты = КаталогКомпоненты+"\"+ИмяФайлаКомпоненты;
		
		ДД_Компоненты.Записать(ПолноеИмяФайлаКомпоненты);
		
	КонецЕсли;
	
	Если ПодключитьВнешнююКомпоненту(ПолноеИмяФайлаКомпоненты,"VK",ТипВнешнейКомпоненты.Native) Тогда  //Каталог+"/"+ИмяФайла
	
		Компонента = Новый("AddIn.VK.PdfToStream");
		Результат = Компонента.ЗагрузитьPDF(ИмяФайла);

		Если Результат Тогда
				
			ДДСкана = Компонента.ПолучитьСтраницу(0);
				
		Иначе

//			ДанныеДокумента = "Не удалось конвертировать в png";
//			Возврат;

		КонецЕсли;
				

	КонецЕсли;
	
	
	Если НужноУдалитьФайл Тогда
		УдалитьФайлы(ИмяФайла);
	КонецЕсли;	
	
КонецФункции

#КонецОбласти

#КонецЕсли
