#Если ТонкийКлиент Тогда

#Область ПрограммныйИнтерфейс

//Обрабатывает документ по хеш сумме
//Параметры:
//	ХешСумма - Строка - Хеш сумма файла
Процедура ОбработатьДокумент(ХешСумма) Экспорт

	Если ПС_ИндексацияФайловВызовСервера.ЭтоСерверLinux() Тогда

		Если ЭтоКлиентLinux() Тогда
			
			//Нужно будет реализовать в дальнейшем необходимость конвертации или конвертацию средствами ИИ
			ВызватьИсключение "Распознавание документов на клиенте Linux не поддерживается.";
			
		Иначе //Если сервер Linux, а клиент Win то произведем конвертацию на клиенте
		
			СконвертированныйСкан = ПолучитьСконвертированныйСканНаКлиенте(ХешСумма);
			
			Если СконвертированныйСкан <> Неопределено Тогда
			
				ПС_ИндексацияФайловВызовСервера.ОбработатьДокумент(ХешСумма, ПоместитьВоВременноеХранилище(СконвертированныйСкан));
				
			КонецЕсли;
			
		КонецЕсли;

	Иначе
		
		ДанныеФайла = ДанныеОдногоФайлаПоХешСумме(ХешСумма);
		
		Если ДанныеФайла.Клиент Тогда
			
			АдресХранилища = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ДанныеФайла.ИмяФайла));
			
		Иначе
			
			АдресХранилища = "";
			
		КонецЕсли;
					
		ПС_ИндексацияФайловВызовСервера.ОбработатьДокумент(ХешСумма, АдресХранилища);
		
	КонецЕсли;
	
КонецПроцедуры

//Возвращает тип ОС
//Возвращаемое значение:
//Булево
Функция ЭтоКлиентLinux() Экспорт
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Возврат СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86 ИЛИ СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86_64;
	
КонецФункции

//Перебирает файлы в каталогах сканирования и заносит в регистр
Процедура ПроверитьКаталогиСФайлами() Экспорт
	
	МассивКаталогов = ПС_ИндексацияФайловВызовСервера.ПолучитьИндексируемыеКаталоги(Истина);
	
	Для каждого ВыборкаКаталогов Из МассивКаталогов Цикл
		
		ПутьККаталогу = ВыборкаКаталогов.ПутьККаталогу;		
		КаталогНаКлиенте = Новый Файл(ПутьККаталогу);
		
		Если НЕ КаталогНаКлиенте.Существует() Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		МассивФайлов = НайтиФайлы(ПутьККаталогу, "*.*", Истина);
		
		Для Каждого Файл Из МассивФайлов Цикл
			
			Если ПС_ИндексацияФайловВызовСервера.ЭтоИзображениеИлиPDF(Файл.Расширение) Тогда
	
				АдресВременногоХранилища = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(Файл.ПолноеИмя));
	
				ХешСумма = ПС_ИндексацияФайловВызовСервера.ПолучитьХешСуммуФайла(АдресВременногоХранилища);

				ПС_ИндексацияФайловВызовСервера.ДобавитьФайлВРегистр(Файл.ПолноеИмя, ХешСумма, Истина);

			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти

//#Область СлужебныйПрограммныйИнтерфейс
//#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеОдногоФайлаПоХешСумме(ХешСумма)

	//Получаем файл
	ДанныеФайлаМассив = ПС_ИндексацияФайловВызовСервера.ПолучитьДанныеРегистраПоХешСумме(ХешСумма);
	
	Если ДанныеФайлаМассив.Количество() = 0 Тогда
		
		Возврат Неопределено;
		
	Иначе
		
		ДанныеФайла = ДанныеФайлаМассив[0];
		
	КонецЕсли;
	
	Возврат ДанныеФайла;
	
КонецФункции

Функция ПолучитьСконвертированныйСканНаКлиенте(ХешСумма)

	//Получаем файл
	ДанныеФайлаМассив = ПС_ИндексацияФайловВызовСервера.ПолучитьДанныеРегистраПоХешСумме(ХешСумма);
	
	Если ДанныеФайлаМассив.Количество() = 0 Тогда
		
		Возврат Неопределено;
		
	Иначе
		
		ДанныеФайла = ДанныеФайлаМассив[0];
		
	КонецЕсли;
	
	ИмяФайла = "";
	НужноУдалитьФайл = Ложь;
	
	Если ДанныеФайла.НаКлиенте Тогда
	
		ИмяФайла = ДанныеФайла.ИмяФайла;
		
	Иначе
		
		ИмяФайла = ПолучитьИмяВременногоФайла();
		ПолучитьФайлССервера = ПС_ИндексацияФайловВызовСервера.ПолучитьФайлССервера(ДанныеФайла.ИмяФайла);
		ПолучитьФайлССервера.Записать(ИмяФайла);
		НужноУдалитьФайл = Истина;
		
	КонецЕсли;
	
	//Получаем компоненту конвертации
	КаталогКомпоненты = КаталогВременныхФайлов() + "PSTools\";
	
	КаталогНаКлиенте = Новый Файл(КаталогКомпоненты);
	
	Если НЕ КаталогНаКлиенте.Существует() Тогда
		
		СоздатьКаталог(КаталогКомпоненты);
		
	КонецЕсли;
	
	ИмяФайлаКомпоненты = "PdfToStream.dll";
	
	СисИнфо = Новый СистемнаяИнформация;
	
	ДД_Компоненты = ПС_ИндексацияФайловВызовСервера.ПолучитьКомпонентыКонвертацииССервера(СисИнфо.ТипПлатформы);
	
	Если НайтиФайлы(КаталогКомпоненты, ИмяФайлаКомпоненты).Количество() = 0 Тогда
		
		ПолноеИмяФайлаКомпоненты = КаталогКомпоненты+"\"+ИмяФайлаКомпоненты;
		
		ДД_Компоненты.Записать(ПолноеИмяФайлаКомпоненты);
		
	КонецЕсли;
	
	МассивДанных = Неопределено;
	
	Если ПодключитьВнешнююКомпоненту(ПолноеИмяФайлаКомпоненты,"VK",ТипВнешнейКомпоненты.Native) Тогда  
	
		Компонента = Новый("AddIn.VK.PdfToStream");
		Результат = Компонента.ЗагрузитьPDF(ИмяФайла);

		Если Результат Тогда
				
			МассивДанных = Новый Массив;
			
			КоличествоСтраниц = Компонента.КоличествоСтраницВДокументе;
			
			Для Ы = 0 По КоличествоСтраниц -1 Цикл	
			
				КартинкаДокумента = Компонента.ПолучитьСтраницу(Ы);
				ТекстДокумента = Компонента.ПолучитьТекстСтраницы(Ы);
				СтруктураДанных = Новый Структура("Картинка, Текст", КартинкаДокумента, ТекстДокумента);
			
				МассивДанных.Вставить(СтруктураДанных);
				
			КонецЦикла;			

		КонецЕсли;
				

	КонецЕсли;
	
	
	Если НужноУдалитьФайл Тогда
		УдалитьФайлы(ИмяФайла);
	КонецЕсли;	
	
	Возврат МассивДанных;
	
КонецФункции

#КонецОбласти

#КонецЕсли
