
#Область ПрограммныйИнтерфейс

//Перебирает файлы в каталогах сканирования и заносит в регистр
Процедура ПроверитьКаталогиСФайлами() Экспорт
	
	МассивКаталогов = ПС_ИндексацияФайловВызовСервера.ПолучитьИндексируемыеКаталоги(Истина);
	
	Для каждого ВыборкаКаталогов Из МассивКаталогов Цикл
		
		ПутьККаталогу = ВыборкаКаталогов.ПутьККаталогу;		
		КаталогНаКлиенте = Новый Файл(ПутьККаталогу);
		
		Если НЕ КаталогНаКлиенте.Существует() Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		МассивФайлов = НайтиФайлы(ПутьККаталогу, "*.*", Истина);
		
		Для Каждого Файл Из МассивФайлов Цикл
			
			Если ПС_ИндексацияФайловВызовСервера.ЭтоИзображениеИлиPDF(Файл.Расширение) Тогда
	
				АдресВременногоХранилища = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(Файл.ПолноеИмя));
	
				ХешСумма = ПС_ИндексацияФайловВызовСервера.ПолучитьХешСуммуФайла(АдресВременногоХранилища);

				ПС_ИндексацияФайловВызовСервера.ДобавитьФайлВРегистр(Файл.ПолноеИмя, ХешСумма, Истина);

			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
