
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

//Перебирает файлы в каталогах сканирования и заносит в регистр
Процедура ПроверитьКаталогиСФайлами() Экспорт
	
	// Создаем выборку элементов справочника ПС_КаталогиПотоковогоСканирования, исключая предопределенный элемент "КаталогДляОбработанныхДокументов" и выбирая только активные элементы.
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПС_КаталогиПотоковогоСканирования.Ссылка КАК Ссылка,
		|	ПС_КаталогиПотоковогоСканирования.ПутьНаСервере КАК ПутьНаСервере
		|ИЗ
		|	Справочник.ПС_КаталогиПотоковогоСканирования КАК ПС_КаталогиПотоковогоСканирования
		|ГДЕ
		|	ПС_КаталогиПотоковогоСканирования.Активен
		|	И
		|		ПС_КаталогиПотоковогоСканирования.Ссылка <> ЗНАЧЕНИЕ(Справочник.ПС_КаталогиПотоковогоСканирования.КаталогДляОбработанныхДокументов)";
	
	
	ВыборкаКаталогов = Запрос.Выполнить().Выбрать();
	
	Пока ВыборкаКаталогов.Следующий() Цикл
		
		ПутьНаСервере = ВыборкаКаталогов.ПутьНаСервере;		
		КаталогНаСервере = Новый Файл(ПутьНаСервере);
		
		Если НЕ КаталогНаСервере.Существует() Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		МассивФайлов = НайтиФайлы(ПутьНаСервере, "*.*", Истина);
		
		Для Каждого Файл Из МассивФайлов Цикл
			
			Если ЭтоИзображениеИлиPDF(Файл.Расширение) Тогда
	
				ХешСумма = ПолучитьХешСуммуФайла(Файл.ПолноеИмя);

				НаборЗаписей = СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.ХешСумма.Установить(ХешСумма);
				НаборЗаписей.Прочитать();
				
				Если НаборЗаписей.Количество() = 0 Тогда
				
					// Добавляем новую запись
					НоваяЗапись = НаборЗаписей.Добавить();
					НоваяЗапись.Период = ТекущаяДатаСеанса();
					НоваяЗапись.ХешСумма = ХешСумма;
					НоваяЗапись.ИмяФайла = Файл.ПолноеИмя;
					
					// Записываем набор записей
					НаборЗаписей.Записать();
					
				КонецЕсли;	

			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЭтоИзображениеИлиPDF(Расширение)
		
	// Проверяем, является ли файл изображением или PDF файлом
	МассивДопустимыхРасширений = Новый Массив;
	МассивДопустимыхРасширений.Добавить(".jpg");
	МассивДопустимыхРасширений.Добавить(".jpeg");
	МассивДопустимыхРасширений.Добавить(".png");
	МассивДопустимыхРасширений.Добавить(".pdf");
	
	Возврат МассивДопустимыхРасширений.Найти(Расширение) <> Неопределено;
	
КонецФункции

Функция ПолучитьХешСуммуФайла(ПолноеИмяФайла)
	
	// Реализация функции расчета хеш-суммы файла
	Хеш = Новый ХешированиеДанных(ХешФункция.MD5);
	Хеш.ДобавитьФайл(ПолноеИмяФайла);
	Возврат Строка(Хеш.ХешСумма);
	
КонецФункции

#КонецОбласти

#КонецЕсли
