
#Область ПрограммныйИнтерфейс

// Создает документ по данным распознавания
// 
// Параметры:
//  ДанныеРаспознавания - Структура - данные распознавания
//  ДополнительныеПараметры - Структура - дополнительные параметры
//  ОбновитьДокумент - Булево - обновить документ
// 
// Возвращаемое значение:
//  ДокументСсылка - созданный документ
//
Функция СоздатьДокумент(ДанныеРаспознавания, ДополнительныеПараметры, ОбновитьДокумент = Ложь, НастройкиЗагрузки = Неопределено) Экспорт
		
	//Если ТипЗнч(ДополнительныеПараметры) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		
			//TODO: Пока не реализовано
		
	//Иначе
		
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Автоматическое создание документов данного вида не предусмотрено";
		СообщениеПользователю.Сообщить();
		Возврат Неопределено;		
		
	//КонецЕсли;
	
КонецФункции


// Создает контрагента по данным распознавания
// 
// Параметры:
//  ДанныеРаспознавания - Структура - данные распознавания
// 
// Возвращаемое значение:
//  СправочникСсылка.Контрагенты - созданный контрагент
Функция СоздатьКонтрагента(ДанныеРаспознавания) Экспорт //TODO: Скопировано из ПС_СозданиеДокументовБухгалтерияПредприятия, не адаптировано под УТ
	
	Найденный = Неопределено;
	
	Если ЗначениеЗаполнено(ДанныеРаспознавания.КонтрагентИД) Тогда
	
		ЗапросПоиска = Новый Запрос;
		ЗапросПоиска.Текст = 
			"ВЫБРАТЬ
			|	Контрагенты.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Контрагенты КАК Контрагенты
			|ГДЕ
			|	Контрагенты.ИНН = &ИНН_ОКПО
			|	И Контрагенты.ИНН <> """"
			|	ИЛИ Контрагенты.КодПоОКПО = &ИНН_ОКПО
			|	И Контрагенты.КодПоОКПО <> """"";
		
		ЗапросПоиска.УстановитьПараметр("ИНН_ОКПО", ДанныеРаспознавания.КонтрагентИД);
				
		РезультатЗапроса = ЗапросПоиска.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			
			Найденный = ВыборкаДетальныеЗаписи.Ссылка;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Найденный = Неопределено Тогда
		
		НовыйКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();
		НовыйКонтрагент.Наименование 		= ДанныеРаспознавания.Реквизиты["name_" + ДанныеРаспознавания.ПрефиксПолейКонтрагента];
		НовыйКонтрагент.НаименованиеПолное 	= ДанныеРаспознавания.Реквизиты["name_" + ДанныеРаспознавания.ПрефиксПолейКонтрагента];
		НовыйКонтрагент.ИНН 				= ДанныеРаспознавания.Реквизиты["INN_" + ДанныеРаспознавания.ПрефиксПолейКонтрагента];
		НовыйКонтрагент.КодПоОКПО 			= ДанныеРаспознавания.Реквизиты["OKPO_" + ДанныеРаспознавания.ПрефиксПолейКонтрагента];
		НовыйКонтрагент.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
		//НовыйКонтрагент.КПП 				= ДанныеРаспознавания.КПП;
		НовыйКонтрагент.Комментарий 		= "#Создан автоматически с помощью N8N";
		НовыйКонтрагент.ДатаСоздания 		= ТекущаяДатаСеанса();
		
		НовыйКонтрагент.Записать();
		
		Найденный = НовыйКонтрагент.Ссылка;	
	
	КонецЕсли;
	
	Возврат Найденный;
	
КонецФункции

#КонецОбласти

//#Область СлужебныйПрограммныйИнтерфейс
//
//// Код процедур и функций
//
//#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НайтиДоговорКонтрагента(ДатаДоговораXML, НомерДоговора, Контрагент, ВидДоговора, Организация) //TODO: Скопировано из ПС_СозданиеДокументовБухгалтерияПредприятия, не адаптировано под УТ

	Попытка
		
		ДатаДоговора = XMLЗначение(Тип("Дата"), ДатаДоговораXML);
		
		
	Исключение
		
		ДатаДоговора = Дата("00010101");
	
	КонецПопытки;	

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
	|	1 КАК Приоритет
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Владелец = &Контрагент
	|	И ДоговорыКонтрагентов.Номер = &НомерДоговора
	|	И ДоговорыКонтрагентов.Дата = &ДатаДоговора
	|	И НЕ ДоговорыКонтрагентов.ЭтоГруппа
	|	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
	|	2 КАК Приоритет
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Владелец = &Контрагент
	|	И НЕ ДоговорыКонтрагентов.ЭтоГруппа
	|	И &НомерЗаполнен
	|	И ДоговорыКонтрагентов.Номер = &НомерДоговора
	|	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
	|	2 КАК Приоритет
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Владелец = &Контрагент
	|	И НЕ ДоговорыКонтрагентов.ЭтоГруппа
	|	И &ДатаЗаполнена
	|	И ДоговорыКонтрагентов.Дата = &ДатаДоговора
	|	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОсновныеДоговорыКонтрагента.Договор КАК Ссылка,
	|	3 КАК Приоритет
	|ИЗ
	|	РегистрСведений.ОсновныеДоговорыКонтрагента КАК ОсновныеДоговорыКонтрагента
	|ГДЕ
	|	ОсновныеДоговорыКонтрагента.Контрагент = &Контрагент
	|	И ОсновныеДоговорыКонтрагента.ВидДоговора = &ВидДоговора
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет,
	|	Ссылка";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ВидДоговора", ВидДоговора);
	Запрос.УстановитьПараметр("НомерДоговора", НомерДоговора);
	Запрос.УстановитьПараметр("НомерЗаполнен", ЗначениеЗаполнено(НомерДоговора));
	Запрос.УстановитьПараметр("ДатаДоговора", ДатаДоговора);
	Запрос.УстановитьПараметр("ДатаЗаполнена", ЗначениеЗаполнено(ДатаДоговора));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.Прямой);
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	НовыйДоговор = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
	НовыйДоговор.Организация = Организация;
	НовыйДоговор.ВалютаВзаиморасчетов = Константы.ВалютаРегламентированногоУчета.Получить();
	НовыйДоговор.Владелец = Контрагент;
	НовыйДоговор.Номер = НомерДоговора;
	НовыйДоговор.Дата = ДатаДоговора;
	НовыйДоговор.ВидДоговора = ВидДоговора;
	НовыйДоговор.Наименование = "Договор " + НомерДоговора + " от " + Формат(ДатаДоговора, "ДЛФ=DD");
	НовыйДоговор.Записать();
	
	Возврат НовыйДоговор.Ссылка;
	
КонецФункции

#КонецОбласти
