
#Область ПрограммныйИнтерфейс

// Создает документ по данным распознавания
// 
// Параметры:
//  ДанныеРаспознавания - Структура - данные распознавания
//  ДополнительныеПараметры - Структура - дополнительные параметры
//  ОбновитьДокумент - Булево - обновить документ
// 
// Возвращаемое значение:
//  ДокументСсылка - созданный документ
//
Функция СоздатьДокумент(ДанныеРаспознавания, ДополнительныеПараметры, ОбновитьДокумент = Ложь) Экспорт
	
	Если ТипЗнч(ДополнительныеПараметры) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		
		//!!! Отдельно сделать товары, отдельно услуги
		Возврат СоздатьДокумент_ПоступлениеТоваровУслуг_Услуги_Сводно(ДанныеРаспознавания, ДополнительныеПараметры, ОбновитьДокумент);
		
	Иначе
		
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Автоматическое создание документов данного вида не предусмотрено";
		СообщениеПользователю.Сообщить();
		Возврат Неопределено;		
		
	КонецЕсли;
	
КонецФункции


// Создает контрагента по данным распознавания
// 
// Параметры:
//  ДанныеРаспознавания - Структура - данные распознавания
// 
// Возвращаемое значение:
//  СправочникСсылка.Контрагенты - созданный контрагент
Функция СоздатьКонтрагента(ДанныеРаспознавания) Экспорт
	
	Найденный = Неопределено;
	
	Если ЗначениеЗаполнено(ДанныеРаспознавания.ИНН) Тогда
	
		ЗапросПоиска = Новый Запрос;
		ЗапросПоиска.Текст = 
			"ВЫБРАТЬ
			|	Контрагенты.Ссылка
			|ИЗ
			|	Справочник.Контрагенты КАК Контрагенты
			|ГДЕ
			|	(Контрагенты.ИНН = &ИНН И &ЕстьИНН) ИЛИ (Контрагенты.КодПоОКПО = &ОКПО И &ЕстьОКПО)";
		
		ЗапросПоиска.УстановитьПараметр("ИНН", ДанныеРаспознавания.ИНН);
		ЗапросПоиска.УстановитьПараметр("ОКПО", ДанныеРаспознавания.ОКПО);
		ЗапросПоиска.УстановитьПараметр("ЕстьИНН", НЕ ПустаяСтрока(ДанныеРаспознавания.ИНН));
		ЗапросПоиска.УстановитьПараметр("ЕстьОКПО", НЕ ПустаяСтрока(ДанныеРаспознавания.ОКПО));
				
		РезультатЗапроса = ЗапросПоиска.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			
			Найденный = ВыборкаДетальныеЗаписи.Ссылка;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Найденный = Неопределено Тогда
	
		НовыйКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();
		НовыйКонтрагент.Наименование 		= ДанныеРаспознавания.Наименование;
		НовыйКонтрагент.НаименованиеПолное 	= ДанныеРаспознавания.Наименование;
		НовыйКонтрагент.ИНН 				= ДанныеРаспознавания.ИНН;
		НовыйКонтрагент.КодПоОКПО 			= ДанныеРаспознавания.ОКПО;
		НовыйКонтрагент.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
		НовыйКонтрагент.КПП 				= ДанныеРаспознавания.КПП;
		НовыйКонтрагент.Комментарий 		= "#Создан автоматически с помощью N8N";
		НовыйКонтрагент.ДатаСоздания 		= ТекущаяДатаСеанса();
		
		НовыйКонтрагент.Записать();
		
		Найденный = НовыйКонтрагент.Ссылка;	
	
	КонецЕсли;
	
	Возврат Найденный;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СоздатьДокумент_ПоступлениеТоваровУслуг_Услуги_Сводно(ДанныеРаспознавания, ДополнительныеПараметры, ОбновитьДокумент)
	
	Если ОбновитьДокумент Тогда
		
		ДокОбъект = ДополнительныеПараметры.ПолучитьОбъект();
		
	Иначе
		
		ДокОбъект = Документы.ПоступлениеТоваровУслуг.СоздатьДокумент();
		ДанныеИзменены = Истина;
		
	КонецЕсли;
	
	ЗаполнитьПолеДокумента(ДокОбъект, "Дата", ДанныеРаспознавания.Дата, ДанныеИзменены);
	ЗаполнитьПолеДокумента(ДокОбъект, "Организация", ДанныеРаспознавания.Организация, ДанныеИзменены);
	ЗаполнитьПолеДокумента(ДокОбъект, "Контрагент", ДанныеРаспознавания.Контрагент, ДанныеИзменены);
	ЗаполнитьПолеДокумента(ДокОбъект, "НомерВходящегоДокумента", ДанныеРаспознавания.Номер, ДанныеИзменены);
	ЗаполнитьПолеДокумента(ДокОбъект, "ДатаВходящегоДокумента", ДанныеРаспознавания.Дата, ДанныеИзменены);
	ЗаполнитьПолеДокумента(ДокОбъект, "ВидОперации", Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Услуги, ДанныеИзменены);
	ЗаполнитьПолеДокумента(ДокОбъект, "ВалютаДокумента", Константы.ВалютаРегламентированногоУчета.Получить(), ДанныеИзменены);
	ЗаполнитьПолеДокумента(ДокОбъект, "Ответственный", ПараметрыСеанса.ТекущийПользователь, ДанныеИзменены);
	ЗаполнитьПолеДокумента(ДокОбъект, "СуммаДокумента", ДанныеРаспознавания.Сумма, ДанныеИзменены);
	
	ДокОбъект.Услуги.Очистить();
	
	НоваяСтрока = ДокОбъект.Услуги.Добавить();
	НоваяСтрока.Количество = 1;
	НоваяСтрока.Цена = ДанныеРаспознавания.Сумма;
	НоваяСтрока.Сумма = ДанныеРаспознавания.Сумма;
	НоваяСтрока.Содержание = ДанныеРаспознавания.КраткоеСодержание;
	
	Если ДанныеИзменены Тогда
	
		Попытка
	
			ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
			
		Исключение
			
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст = "Не удалось записать загруженный документ";
			СообщениеПользователю.Сообщить();
			
			Возврат Неопределено;
			
		КонецПопытки;
				
		Попытка
			
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		Исключение
			
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст = "Не удалось провести загруженный документ";
			СообщениеПользователю.Сообщить();
			
		КонецПопытки;
		
		НовыйДокумент = ДокОбъект.Ссылка;
		
	Иначе
		
		НовыйДокумент = ДополнительныеПараметры;
		
	КонецЕсли;
	
	Возврат НовыйДокумент;
	
КонецФункции

Процедура ЗаполнитьПолеДокумента(ДокОбъект, ИмяПоля, ЗначениеПоля, ДанныеИзменены)

	Если ЗначениеЗаполнено(ЗначениеПоля) Тогда //И ОбщегоНазначения.ЕстьРеквизитОбъекта(ИмяПоля, ДокОбъект.Метаданные()) Тогда
	
		Если ДокОбъект[ИмяПоля] <> ЗначениеПоля Тогда
	
			ДокОбъект[ИмяПоля] = ЗначениеПоля;
			ДанныеИзменены = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
