
#Область ПрограммныйИнтерфейс

// Создает документ по данным распознавания
// 
// Параметры:
//  ДанныеРаспознавания - Структура - данные распознавания
//  ДополнительныеПараметры - Структура - дополнительные параметры
//  ОбновитьДокумент - Булево - обновить документ
// 
// Возвращаемое значение:
//  ДокументСсылка - созданный документ
//
Функция СоздатьДокумент(ДанныеРаспознавания, ДополнительныеПараметры, ОбновитьДокумент = Ложь) Экспорт
	
	Если ТипЗнч(ДополнительныеПараметры) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		
		//TODO: Отдельно сделать товары, отдельно услуги
		Возврат СоздатьДокумент_ПоступлениеТоваровУслуг_Услуги_Сводно(ДанныеРаспознавания, ДополнительныеПараметры, ОбновитьДокумент);
		
	Иначе
		
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Автоматическое создание документов данного вида не предусмотрено";
		СообщениеПользователю.Сообщить();
		Возврат Неопределено;		
		
	КонецЕсли;
	
КонецФункции


// Создает контрагента по данным распознавания
// 
// Параметры:
//  ДанныеРаспознавания - Структура - данные распознавания
// 
// Возвращаемое значение:
//  СправочникСсылка.Контрагенты - созданный контрагент
Функция СоздатьКонтрагента(ДанныеРаспознавания) Экспорт
	
	Найденный = Неопределено;
	
	Если ЗначениеЗаполнено(ДанныеРаспознавания.КонтрагентИД) Тогда
	
		ЗапросПоиска = Новый Запрос;
		ЗапросПоиска.Текст = 
			"ВЫБРАТЬ
			|	Контрагенты.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Контрагенты КАК Контрагенты
			|ГДЕ
			|	Контрагенты.ИНН = &ИНН_ОКПО
			|	И Контрагенты.ИНН <> """"
			|	ИЛИ Контрагенты.КодПоОКПО = &ИНН_ОКПО
			|	И Контрагенты.КодПоОКПО <> """"";
		
		ЗапросПоиска.УстановитьПараметр("ИНН_ОКПО", ДанныеРаспознавания.КонтрагентИД);
				
		РезультатЗапроса = ЗапросПоиска.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			
			Найденный = ВыборкаДетальныеЗаписи.Ссылка;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Найденный = Неопределено Тогда
		
		НовыйКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();
		НовыйКонтрагент.Наименование 		= ДанныеРаспознавания.Реквизиты["name_" + ДанныеРаспознавания.ПрефиксПолейКонтрагента];
		НовыйКонтрагент.НаименованиеПолное 	= ДанныеРаспознавания.Реквизиты["name_" + ДанныеРаспознавания.ПрефиксПолейКонтрагента];
		НовыйКонтрагент.ИНН 				= ДанныеРаспознавания.Реквизиты["INN_" + ДанныеРаспознавания.ПрефиксПолейКонтрагента];
		НовыйКонтрагент.КодПоОКПО 			= ДанныеРаспознавания.Реквизиты["OKPO_" + ДанныеРаспознавания.ПрефиксПолейКонтрагента];
		НовыйКонтрагент.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
		//НовыйКонтрагент.КПП 				= ДанныеРаспознавания.КПП;
		НовыйКонтрагент.Комментарий 		= "#Создан автоматически с помощью N8N";
		НовыйКонтрагент.ДатаСоздания 		= ТекущаяДатаСеанса();
		
		НовыйКонтрагент.Записать();
		
		Найденный = НовыйКонтрагент.Ссылка;	
	
	КонецЕсли;
	
	Возврат Найденный;
	
КонецФункции

#КонецОбласти

//#Область СлужебныйПрограммныйИнтерфейс
//
//// Код процедур и функций
//
//#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СоздатьДокумент_ПоступлениеТоваровУслуг_Услуги_Сводно(ДанныеРаспознавания, ДополнительныеПараметры, ОбновитьДокумент)
	
	ДанныеИзменены = Ложь;
	
	Если ОбновитьДокумент Тогда
		
		ДокОбъект = ДополнительныеПараметры.ПолучитьОбъект();
		
	Иначе
		
		ДокОбъект = Документы.ПоступлениеТоваровУслуг.СоздатьДокумент();
		ДанныеИзменены = Истина;
		
	КонецЕсли;
	
	ДокОбъект.СуммаВключаетНДС = Истина;
	
	ЗаполнитьПолеДокумента(ДокОбъект, "Дата", ДанныеРаспознавания.Дата, ДанныеИзменены);
	ЗаполнитьПолеДокумента(ДокОбъект, "Организация", ДанныеРаспознавания.Организация, ДанныеИзменены);
	ЗаполнитьПолеДокумента(ДокОбъект, "Контрагент", ДанныеРаспознавания.Контрагент, ДанныеИзменены);
	ЗаполнитьПолеДокумента(ДокОбъект, "НомерВходящегоДокумента", ДанныеРаспознавания.Номер, ДанныеИзменены);
	ЗаполнитьПолеДокумента(ДокОбъект, "ДатаВходящегоДокумента", ДанныеРаспознавания.Дата, ДанныеИзменены);
	ЗаполнитьПолеДокумента(ДокОбъект, "ВидОперации", Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Услуги, ДанныеИзменены);
	ЗаполнитьПолеДокумента(ДокОбъект, "ВалютаДокумента", Константы.ВалютаРегламентированногоУчета.Получить(), ДанныеИзменены);
	ЗаполнитьПолеДокумента(ДокОбъект, "Ответственный", ПараметрыСеанса.ТекущийПользователь, ДанныеИзменены);
	ЗаполнитьПолеДокумента(ДокОбъект, "СуммаДокумента", ДанныеРаспознавания.Сумма, ДанныеИзменены);
	
	Если ЗначениеЗаполнено(ДанныеРаспознавания.Реквизиты.contract_date) Или ЗначениеЗаполнено(ДанныеРаспознавания.Реквизиты.contract_number) Тогда
	
		ДоговорКонтрагента = НайтиДоговорКонтрагента(ДанныеРаспознавания.Реквизиты.contract_date, 
		ДанныеРаспознавания.Реквизиты.contract_number, 
		ДанныеРаспознавания.Контрагент,
		Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком,
		ДанныеРаспознавания.Организация);
		
		Если ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
			ЗаполнитьПолеДокумента(ДокОбъект, "ДоговорКонтрагента", ДоговорКонтрагента, ДанныеИзменены);
		КонецЕсли;
	
	КонецЕсли;
	
	ДокОбъект.Услуги.Очистить();
	
	ДанныеИзменены = Истина; //Пока так, будем каждый раз перезаписывать, потом нужно будет добавить контроль изменения строк
	
	НоваяСтрока = ДокОбъект.Услуги.Добавить();
	НоваяСтрока.Количество = 1;
	НоваяСтрока.Цена = ДанныеРаспознавания.Сумма;
	НоваяСтрока.Сумма = ДанныеРаспознавания.Сумма;
	НоваяСтрока.СуммаНДС = ПС_СлужебныеФункцииВызовСервера.Число2(ДанныеРаспознавания.Реквизиты.summ_nds);
	НоваяСтрока.СтавкаНДС = НайтиСтавкуНДС(ПС_СлужебныеФункцииВызовСервера.Число2(ДанныеРаспознавания.Реквизиты.value_VAT_rate));
	НоваяСтрока.Содержание = ДанныеРаспознавания.КраткоеСодержание;
	
	Если ДанныеИзменены Тогда
	
		ДокОбъект.ДополнительныеСвойства.Вставить("ЗаполнитьСчетаУчетаПередЗаписью", Истина);
	
		СчетаУчетаВДокументах.ЗаполнитьПередЗаписью(ДокОбъект, РежимЗаписиДокумента.Запись);
		СчетаУчетаВДокументах.ЗаполнитьСчетаУчетаВТабличнойЧасти(ДокОбъект, "Услуги");
	
		Попытка
	
			ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
			
		Исключение
			
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст = "Не удалось записать загруженный документ";
			СообщениеПользователю.Сообщить();
			
			Возврат Неопределено;
			
		КонецПопытки;
				
		Попытка
			
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		Исключение
			
			СообщениеПользователю = Новый СообщениеПользователю;
			СообщениеПользователю.Текст = "Не удалось провести загруженный документ";
			СообщениеПользователю.Сообщить();
			
		КонецПопытки;
		
		НовыйДокумент = ДокОбъект.Ссылка;
		СписокДокументов = Новый СписокЗначений;
		СписокДокументов.Добавить(НовыйДокумент);
		СтатусИзменен = ОбщегоНазначенияБПВызовСервера.УстановитьСтатусыДокументов(СписокДокументов, Перечисления.СтатусыДокументовПоступления.ОригиналПолучен);
		
	Иначе
		
		НовыйДокумент = ДополнительныеПараметры;
		
	КонецЕсли;
	
	Возврат НовыйДокумент;
	
КонецФункции

Функция НайтиДоговорКонтрагента(ДатаДоговораXML, НомерДоговора, Контрагент, ВидДоговора, Организация)

	Попытка
		
		ДатаДоговора = XMLЗначение(Тип("Дата"), ДатаДоговораXML);
		
		
	Исключение
		
		ДатаДоговора = Дата("00010101");
	
	КонецПопытки;	

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
	|	1 КАК Приоритет
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Владелец = &Контрагент
	|	И ДоговорыКонтрагентов.Номер = &НомерДоговора
	|	И ДоговорыКонтрагентов.Дата = &ДатаДоговора
	|	И НЕ ДоговорыКонтрагентов.ЭтоГруппа
	|	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
	|	2 КАК Приоритет
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Владелец = &Контрагент
	|	И НЕ ДоговорыКонтрагентов.ЭтоГруппа
	|	И &НомерЗаполнен
	|	И ДоговорыКонтрагентов.Номер = &НомерДоговора
	|	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
	|	2 КАК Приоритет
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Владелец = &Контрагент
	|	И НЕ ДоговорыКонтрагентов.ЭтоГруппа
	|	И &ДатаЗаполнена
	|	И ДоговорыКонтрагентов.Дата = &ДатаДоговора
	|	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ОсновныеДоговорыКонтрагента.Договор КАК Ссылка,
	|	3 КАК Приоритет
	|ИЗ
	|	РегистрСведений.ОсновныеДоговорыКонтрагента КАК ОсновныеДоговорыКонтрагента
	|ГДЕ
	|	ОсновныеДоговорыКонтрагента.Контрагент = &Контрагент
	|	И ОсновныеДоговорыКонтрагента.ВидДоговора = &ВидДоговора
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет,
	|	Ссылка";
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ВидДоговора", ВидДоговора);
	Запрос.УстановитьПараметр("НомерДоговора", НомерДоговора);
	Запрос.УстановитьПараметр("НомерЗаполнен", ЗначениеЗаполнено(НомерДоговора));
	Запрос.УстановитьПараметр("ДатаДоговора", ДатаДоговора);
	Запрос.УстановитьПараметр("ДатаЗаполнена", ЗначениеЗаполнено(ДатаДоговора));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.Прямой);
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	НовыйДоговор = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
	НовыйДоговор.Организация = Организация;
	НовыйДоговор.ВалютаВзаиморасчетов = Константы.ВалютаРегламентированногоУчета.Получить();
	НовыйДоговор.Владелец = Контрагент;
	НовыйДоговор.Номер = НомерДоговора;
	НовыйДоговор.Дата = ДатаДоговора;
	НовыйДоговор.ВидДоговора = ВидДоговора;
	НовыйДоговор.Наименование = "Договор " + НомерДоговора + " от " + Формат(ДатаДоговора, "ДЛФ=DD");
	НовыйДоговор.Записать();
	
	Возврат НовыйДоговор.Ссылка;
	
КонецФункции

Функция НайтиСтавкуНДС(ЗначениеНДС)
	
	Попытка
		
		Возврат Перечисления.СтавкиНДС["НДС" + Строка(ЗначениеНДС)];
		
	Исключение
		
		Возврат Перечисления.СтавкиНДС.БезНДС;
		
	КонецПопытки;
	
КонецФункции

Процедура ЗаполнитьПолеДокумента(ДокОбъект, ИмяПоля, ЗначениеПоля, ДанныеИзменены)

	Если ЗначениеЗаполнено(ЗначениеПоля) Тогда //И ОбщегоНазначения.ЕстьРеквизитОбъекта(ИмяПоля, ДокОбъект.Метаданные()) Тогда
	
		Если ДокОбъект[ИмяПоля] <> ЗначениеПоля Тогда
	
			ДокОбъект[ИмяПоля] = ЗначениеПоля;
			ДанныеИзменены = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
