
#Область ПрограммныйИнтерфейс

// Возвращает значение параметра распознавания
// Параметры:
//	ИмяНастройки - Строка - Имя настройки
// Возвращаемое значение:
//	Строка - Значение настройки
//
Функция ПолучитьНастройкуРаспознавания(ИмяНастройки) Экспорт

	Возврат Справочники.ПС_НастройкиРаспознавания.ПараметрРаспознавания(ИмяНастройки);
	
КонецФункции

//Переупаковывает PDF файл
//Параметры:
//	МассивДанных - Массив структур
//Возвращаемое значение:
//	Строка - Адрес файла на сервере
Функция ПереупаковатьPDF(МассивДанных) Экспорт
	
	Макет = ПолучитьОбщийМакет("МакетДляСборки");
	ТабДок = Новый ТабличныйДокумент;
	
	Для каждого ТекЭлемент Из МассивДанных Цикл
			
		ДвоичныеДанные = ТекЭлемент.Картинка;
			
		Если ДвоичныеДанные <> Неопределено Тогда
				
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			Область = Макет.ПолучитьОбласть("Изображение");
			Рисунок = Область.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
			Рисунок.Высота = 297;
			Рисунок.Ширина = 210;
			Рисунок.РазмерКартинки = РазмерКартинки.Пропорционально;
			Рисунок.ГраницаСверху = Истина;
			Рисунок.ГраницаСнизу = Истина;
			Рисунок.ГраницаСправа = Истина;
			Рисунок.ГраницаСлева = Истина;
				
			Рисунок.Картинка = Новый Картинка(ДвоичныеДанные);
			Рисунок.Линия = Новый Линия(ТипЛинииРисункаТабличногоДокумента.Сплошная, 3);
			ТабДок.Вывести(Область);
				
		КонецЕсли;
		
	КонецЦикла;
	
	ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	ОбластьТекст = Макет.ПолучитьОбласть("СтрокаТекста");
			
	Для каждого ТекЭлемент Из МассивДанных Цикл
			
        Текст = ТекЭлемент.Текст;
            
		Если Текст = Неопределено Тогда
				
			Продолжить;
				
		КонецЕсли;
			
		Для Счетчик = 1 По СтрЧислоСтрок(Текст) Цикл
				
			СтрокаТекст = СтрПолучитьСтроку(Текст,Счетчик);
			ОбластьТекст.Параметры.Текст = СокрЛП(СтрокаТекст);
			ТабДок.Вывести(ОбластьТекст);
				
		КонецЦикла;
			
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			
	КонецЦикла;	
				
	ТабДок.АвтоМасштаб = истина;
	ТабДок.ШиринаСтраницы = 210;
	ТабличныйДокумент = ТабДок;	
		
	Возврат ТабличныйДокумент;
	
КонецФункции

//Обрабатывает документ по хеш сумме
//Параметры:
//	ХешСумма - Строка - Хеш сумма файла
//  АдресФайлаНаКлиенте - Строка - Адрес файла на клиенте
Процедура ОбработатьДокумент(ХешСумма, АдресФайлаНаКлиенте = "") Экспорт
	
	НаборЗаписейРегистра = РегистрыСведений.ПС_ОбработкаДокументов.СоздатьНаборЗаписей();
	НаборЗаписейРегистра.Отбор.ХешСумма.Установить(ХешСумма);
	НаборЗаписейРегистра.Прочитать();
	
	Если НаборЗаписейРегистра.Количество() > 0 Тогда
	
		ЗаписьРегистра = НаборЗаписейРегистра[0];
		
		ЗаписьРегистра.КомментарийОбработки = "";
		ЗаписьРегистра.КоличествоПопыток = НаборЗаписейРегистра[0].КоличествоПопыток + 1; 
	
		Если НЕ ЗаписьРегистра.Распознан Тогда
			
			УспешноРаспознан = РаспознатьДокумент(ЗаписьРегистра, АдресФайлаНаКлиенте);
			
		КонецЕсли;
		
		НаборЗаписейРегистра.Записать();
		
	КонецЕсли;
	
КонецПроцедуры

//Возвращает файл с сервера
//Параметры:
//	ИмяФайла - Строка - Имя файла
//Возвращаемое значение:
//	ДвоичныеДанные - Двоичные данные файла
Функция ПолучитьФайлССервера(ИмяФайла) Экспорт

	Возврат ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяФайла));
	
КонецФункции

//Возвращает файл с сервера
//Параметры:
//	ТипПлатформы - Строка - тип платформы клиента/сервера
//Возвращаемое значение:
//	ДвоичныеДанные - Двоичные данные файла
Функция ПолучитьКомпонентыКонвертацииССервера(ТипПлатформы) Экспорт
	
	Если СтрНайти(ТипПлатформы,"Windows x86-64") > 0 Тогда
		 
		ДвДанные = ПолучитьОбщийМакет("NativeComp_x64");
		
	ИначеЕсли СтрНайти(ТипПлатформы,"Windows") > 0 Тогда
		
		ДвДанные = ПолучитьОбщийМакет("NativeComp_x86");
		
	Иначе
		
		ВызватьИсключение "Платформа не поддерживается текущей компонентой";
		
	КонецЕсли;

	Возврат ПоместитьВоВременноеХранилище(ДвДанные);
	
КонецФункции
//Возвращает тип ОС
//Возвращаемое значение:
//Булево
Функция ЭтоСерверLinux() Экспорт
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Возврат СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86 ИЛИ СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86_64;
	
КонецФункции

//Возвращает данные регистра по хеш сумме
//Параметры:
//	ХешСумма - Строка - Хеш сумма файла
//Возвращаемое значение:
//	РезультатЗапроса - Массив структур
Функция ПолучитьДанныеРегистраПоХешСумме(ХешСумма) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ПС_ОбработкаДокументов.Период КАК Период,
	|	ПС_ОбработкаДокументов.Объект КАК Объект,
	|	ПС_ОбработкаДокументов.ХешСумма КАК ХешСумма,
	|	ПС_ОбработкаДокументов.Распознан КАК Распознан,
	|	ПС_ОбработкаДокументов.Найден КАК Найден,
	|	ПС_ОбработкаДокументов.Прикреплен КАК Прикреплен,
	|	ПС_ОбработкаДокументов.КоличествоПопыток КАК КоличествоПопыток,
	|	ПС_ОбработкаДокументов.ИзвлеченныйТекст КАК ИзвлеченныйТекст,
	|	ПС_ОбработкаДокументов.Вероятность КАК Вероятность,
	|	ПС_ОбработкаДокументов.КлючевыеРеквизиты КАК КлючевыеРеквизиты,
	|	ПС_ОбработкаДокументов.ОбработкаЗавершена КАК ОбработкаЗавершена,
	|	ПС_ОбработкаДокументов.ИмяФайла КАК ИмяФайла,
	|	ПС_ОбработкаДокументов.НаКлиенте КАК НаКлиенте,
	|	ПС_ОбработкаДокументов.ПредставлениеДокумента КАК ПредставлениеДокумента,
	|	ПС_ОбработкаДокументов.ТипДокумента КАК ТипДокумента,
	|	ПС_ОбработкаДокументов.КомментарийОбработки КАК КомментарийОбработки
	|ИЗ
	|	РегистрСведений.ПС_ОбработкаДокументов КАК ПС_ОбработкаДокументов
	|ГДЕ
	|	ПС_ОбработкаДокументов.ХешСумма = &ХешСумма
	|	И НЕ ПС_ОбработкаДокументов.ОбработкаЗавершена";
	
	Запрос.УстановитьПараметр("ХешСумма", ХешСумма);
	ТаблицаЗначений = Запрос.Выполнить().Выгрузить();	
	
	Результат = Новый Массив;
	
	СтруктураСтрока = Новый Структура;
	
	Для каждого ТекКолонка Из ТаблицаЗначений.Колонки Цикл
		
		СтруктураСтрока.Вставить(ТекКолонка.Имя);
		
	КонецЦикла;
	
	Для каждого ТекСтрока Из ТаблицаЗначений Цикл
		
		ЗаполнитьЗначенияСвойств(СтруктураСтрока, ТекСтрока);
		Результат.Добавить(СтруктураСтрока);
		
	КонецЦикла;	
	
	Возврат Результат;
	
КонецФункции

// Возвращает массив каталогов
//Параметры:
// КаталогиНаКлиенте - булево
// Возвращает массив Обрабатываемых каталогов с полями:
//	ПутьНаСервере - строка
//	НаКлиенте - булево
//Возвращаемое значение:
//	Тип: массив структур
Функция ПолучитьИндексируемыеКаталоги(КаталогиНаКлиенте = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПС_КаталогиПотоковогоСканирования.Ссылка КАК Ссылка,
		|	ПС_КаталогиПотоковогоСканирования.ПутьККаталогу КАК ПутьККаталогу,
		|	ПС_КаталогиПотоковогоСканирования.НаКлиенте КАК НаКлиенте
		|ИЗ
		|	Справочник.ПС_КаталогиПотоковогоСканирования КАК ПС_КаталогиПотоковогоСканирования
		|ГДЕ
		|	ПС_КаталогиПотоковогоСканирования.Активен
		|	И
		|		ПС_КаталогиПотоковогоСканирования.Ссылка <> ЗНАЧЕНИЕ(Справочник.ПС_КаталогиПотоковогоСканирования.КаталогДляОбработанныхДокументов)
		|	И (&КаталогиНаКлиенте = НЕОПРЕДЕЛЕНО
		|	ИЛИ ПС_КаталогиПотоковогоСканирования.НаКлиенте = &КаталогиНаКлиенте)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НаКлиенте";
	
	Запрос.УстановитьПараметр("КаталогиНаКлиенте", КаталогиНаКлиенте);
	
	ВыборкаКаталогов = Запрос.Выполнить().Выбрать();
	
	Результат = Новый Массив;
	
	Пока ВыборкаКаталогов.Следующий() Цикл
		
		СтруктураКаталога = Новый Структура;
		СтруктураКаталога.Вставить("ПутьККаталогу", ВыборкаКаталогов.ПутьККаталогу);
		СтруктураКаталога.Вставить("НаКлиенте", ВыборкаКаталогов.НаКлиенте);
		
		Результат.Добавить(СтруктураКаталога);
		
	КонецЦикла;
	
	Возврат Результат;	
		
КонецФункции

//Перебирает файлы в каталогах сканирования и заносит в регистр
Процедура ПроверитьКаталогиСФайлами() Экспорт
	
	МассивКаталогов = ПолучитьИндексируемыеКаталоги(Ложь);
	
	Для каждого ВыборкаКаталогов Из МассивКаталогов Цикл
		
		ПутьККаталогу = ВыборкаКаталогов.ПутьККаталогу;		
		КаталогНаСервере = Новый Файл(ПутьККаталогу);
		
		Если НЕ КаталогНаСервере.Существует() Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		МассивФайлов = НайтиФайлы(ПутьККаталогу, "*.*", Истина);
		
		Для Каждого Файл Из МассивФайлов Цикл
			
			Если ЭтоИзображениеИлиPDF(Файл.Расширение) Тогда
	
				ХешСумма = ПолучитьХешСуммуФайла(Файл.ПолноеИмя);

				ДобавитьФайлВРегистр(Файл.ПолноеИмя, ХешСумма);

			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

//Добавляет файл в регистр
//Параметры:
//	ПутьКФайлу - строка
//	ХешСумма - строка
//	ФайлНаКлиенте - булево
Процедура ДобавитьФайлВРегистр(ПутьКФайлу, ХешСумма, ФайлНаКлиенте = Ложь) Экспорт

	НаборЗаписей = РегистрыСведений.ПС_ОбработкаДокументов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ХешСумма.Установить(ХешСумма);
	НаборЗаписей.Прочитать();
				
	Если НаборЗаписей.Количество() = 0 Тогда
				
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.Период = ТекущаяДатаСеанса();
		НоваяЗапись.ХешСумма = ХешСумма;
		НоваяЗапись.ИмяФайла = ПутьКФайлу;
		НоваяЗапись.НаКлиенте = ФайлНаКлиенте;
					
		НаборЗаписей.Записать();
					
	КонецЕсли;	
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСконвертированныйСканНаСервере(ИмяФайла)

	Слэш = ?(ЭтоСерверLinux(), "/", "\");

	//Получаем компоненту конвертации
	КаталогКомпоненты = КаталогВременныхФайлов() + "PSTools" + Слэш;
	
	КаталогНаКлиенте = Новый Файл(КаталогКомпоненты);
	
	Если НЕ КаталогНаКлиенте.Существует() Тогда
		
		СоздатьКаталог(КаталогКомпоненты);
		
	КонецЕсли;
	
	ИмяФайлаКомпоненты = "PdfToStream.dll";
	
	СисИнфо = Новый СистемнаяИнформация;
	
	Если НайтиФайлы(КаталогКомпоненты, ИмяФайлаКомпоненты).Количество() = 0 Тогда
	
		ДД_Компоненты = ПолучитьКомпонентыКонвертацииССервера(СисИнфо.ТипПлатформы);	
			
		ПолноеИмяФайлаКомпоненты = КаталогКомпоненты + Слэш + ИмяФайлаКомпоненты;
		
		ДД_Компоненты.Записать(ПолноеИмяФайлаКомпоненты);
		
	КонецЕсли;
	
	МассивДанных = Неопределено;
	
	Если ПодключитьВнешнююКомпоненту(ПолноеИмяФайлаКомпоненты,"VK",ТипВнешнейКомпоненты.Native) Тогда  
	
		Компонента = Новый("AddIn.VK.PdfToStream");
		Результат = Компонента.ЗагрузитьPDF(ИмяФайла);

		Если Результат Тогда
				
			МассивДанных = Новый Массив;
			
			КоличествоСтраниц = Компонента.КоличествоСтраницВДокументе;
			
			Для Ы = 0 По КоличествоСтраниц -1 Цикл	
			
				КартинкаДокумента = Компонента.ПолучитьСтраницу(Ы);
				ТекстДокумента = Компонента.ПолучитьТекстСтраницы(Ы);
				СтруктураДанных = Новый Структура("Картинка, Текст", КартинкаДокумента, ТекстДокумента);
			
				МассивДанных.Вставить(СтруктураДанных);
				
			КонецЦикла;			

		КонецЕсли;
				

	КонецЕсли;
	
	Возврат МассивДанных;
	
КонецФункции

Функция РаспознатьДокумент(ЗаписьРегистра, АдресФайлаНаКлиенте = "")
	
	РезультатУспешноРаспознан = Ложь;
	
	НужноУдалитьФайл = Ложь;
	
	Если ЗаписьРегистра.НаКлиенте И ЭтоАдресВременногоХранилища(АдресФайлаНаКлиенте) Тогда
		
		ДанныеИзХранилища = ПолучитьИзВременногоХранилища(АдресФайлаНаКлиенте);
		
		Если ТипЗнч(ДанныеИзХранилища) = Тип("Массив") Тогда //PDF сконвертирован на клиенте
		
			ДокументСОбрамлением = ПереупаковатьPDF(ДанныеИзХранилища);
			
			ИмяВременногоФайла = ПолучитьИмяВременногоФайла("pdf");	
			ДокументСОбрамлением.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.PDF);
		
		ИначеЕсли ТипЗнч(ДанныеИзХранилища) = Тип("Структура") И ДанныеИзХранилища.Свойство("БылаПопыткаКонвертации") Тогда 
		
			ДокументБезОбрамления = ДанныеИзХранилища.ДвоичныеДанныеФайлаНаКлиенте;
			ИмяВременногоФайла = ПолучитьИмяВременногоФайла("pdf");	
			ДокументБезОбрамления.Записать(ИмяВременногоФайла);

			ПолноеИмяФайла = ИмяВременногоФайла;			
			
		Иначе //Сохраняем и конвертируем на сервере, т.к. предполагается, что это win сервер, иначе пришел бы массив
		
			Если ПолучитьНастройкуРаспознавания("ИспользоватьКомпонентуОкантовки") = Ложь Тогда
		
				ИмяВременногоФайла = ПолучитьИмяВременногоФайла("pdf");	
				ДанныеИзХранилища.Записать(ИмяВременногоФайла);	
				ПолноеИмяФайла = ИмяВременногоФайла;		
		
			Иначе
		
				ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
				ДвоичныеДанные = ДанныеИзХранилища;
				ДвоичныеДанные.Записать(ИмяВременногоФайла);
				
				УдалитьФайлы(ИмяВременногоФайла);
				
				ДД_PDF = ПолучитьСконвертированныйСканНаСервере(ИмяВременногоФайла);
				
				ДокументСОбрамлением = ПереупаковатьPDF(ДД_PDF);
				
				ИмяВременногоФайла = ПолучитьИмяВременногоФайла("pdf");	
				ДокументСОбрамлением.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.PDF);
	
				ПолноеИмяФайла = ИмяВременногоФайла;
				
			КонецЕсли;
			
		КонецЕсли;
		
		НужноУдалитьФайл = Истина;
		
	Иначе

		ПолноеИмяФайла = ЗаписьРегистра.ИмяФайла;
		
		Если ПолучитьНастройкуРаспознавания("ИспользоватьКомпонентуОкантовки") <> Ложь Тогда
		
			ДД_PDF = ПолучитьСконвертированныйСканНаСервере(ПолноеИмяФайла);
				
			ДокументСОбрамлением = ПереупаковатьPDF(ДД_PDF);
				
			ИмяВременногоФайла = ПолучитьИмяВременногоФайла("pdf");	
			ДокументСОбрамлением.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.PDF);
	
			ПолноеИмяФайла = ИмяВременногоФайла;
			
			НужноУдалитьФайл = Истина;
			
		КонецЕсли;
				
	КонецЕсли;
	
	ДДСкана = Новый ДвоичныеДанные(ПолноеИмяФайла);
		
	//Отправка в N8N		
	РезультатОбработки = РаспознатьДокументN8N(ДДСкана);
		
	Если РезультатОбработки.ОбработанУспешно Тогда
			
			ЗаписьРегистра.ИзвлеченныйТекст = СтруктураВJSON(РезультатОбработки.РаспознанныеДанные);
			ЗаписьРегистра.КлючевыеРеквизиты = СтруктураВJSON(РезультатОбработки.КлючевыеРеквизиты);
			
			ЗаписьРегистра.Распознан = Истина;
			РезультатУспешноРаспознан = Истина;
			
	КонецЕсли;
		
	ЗаписьРегистра.КомментарийОбработки = ЗаписьРегистра.КомментарийОбработки 
	+ ?(ЗаписьРегистра.КомментарийОбработки  = "", "", Символы.ПС) + РезультатОбработки.Комментарий;
	
	//Удаляем только временный файл, переписанный с клиента.
	//Если это исходный файл, его не трогаем
	Если НужноУдалитьФайл Тогда
		УдалитьФайлы(ИмяВременногоФайла);
	КонецЕсли;	
	
	Возврат РезультатУспешноРаспознан;
	
КонецФункции

Функция СтруктураВJSON(Структура)
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	
	НастройкиСериализации = Новый НастройкиСериализацииJSON;
	НастройкиСериализации.СериализовыватьМассивыКакОбъекты = Ложь;
	
	ЗаписатьJSON(ЗаписьJSON, Структура, НастройкиСериализации);
	
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

Функция JSONВСтруктуру(СтрокаJSON)
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	
	Возврат ПрочитатьJSON(ЧтениеJSON);
	
КонецФункции


Функция ЭтоКлючевойРеквизит(ИмяРеквизита)
	
	МассивКлючевых = Новый Массив;
	МассивКлючевых.Добавить("INN_client");
	МассивКлючевых.Добавить("INN_company");
	МассивКлючевых.Добавить("date");
	МассивКлючевых.Добавить("number");
	МассивКлючевых.Добавить("doc_type");
	
	Возврат МассивКлючевых.Найти(ИмяРеквизита) <> Неопределено;
	
КонецФункции

Функция РаспознатьДокументN8N(ДДСкана)
	
	РезультатОбработки = Новый Структура;
	РезультатОбработки.Вставить("ОбработанУспешно", Ложь);
	РезультатОбработки.Вставить("Комментарий", "");
	РезультатОбработки.Вставить("РаспознанныеДанные", Новый Структура);
	РезультатОбработки.Вставить("КлючевыеРеквизиты", Новый Структура);
	
	ДД_64 = Base64Строка(ДДСкана);
	
	Логин = Справочники.ПС_НастройкиРаспознавания.ПараметрРаспознавания("ЛогинN8N");
	Пароль = Справочники.ПС_НастройкиРаспознавания.ПараметрРаспознавания("ПарольN8N");

	Аутентификация = ПС_КоннекторHTTP.НоваяАутентификацияBasic(Логин, Пароль);
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("x-client-id", "");
	    
	// Определение структуры
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("model", "mistral");
	    
	Сообщения = Новый Массив;
	    
	СообщениеСистемы = Новый Структура;
	СообщениеСистемы.Вставить("document_base64", ДД_64);
	Сообщения.Add(СообщениеСистемы);
	    
	СтруктураДанных.Вставить("messages", Сообщения);
	
	АдресСервисаРаспознаванияДокументов = Справочники.ПС_НастройкиРаспознавания.ПараметрРаспознавания("АдресСервисаРаспознаванияДокументов");

	Попытка

		Результат = ПС_КоннекторHTTP.PostJSON(АдресСервисаРаспознаванияДокументов, СтруктураДанных, 
		Новый Структура("Аутентификация,Заголовки,Таймаут", Аутентификация, Заголовки, 120));
	
		ЕстьДанные = Ложь;

		Для каждого ТекЭлемент Из Результат["output"] Цикл
		
			РезультатОбработки.РаспознанныеДанные.Вставить(ТекЭлемент.Ключ, ТекЭлемент.Значение);	
			
			Если ЭтоКлючевойРеквизит(ТекЭлемент.Ключ) Тогда
			
				РезультатОбработки.КлючевыеРеквизиты.Вставить(ТекЭлемент.Ключ, ТекЭлемент.Значение);
				
			КонецЕсли;
			
			ЕстьДанные = Истина;
	
		КонецЦикла;	
		
		Если ЕстьДанные Тогда
		
			РезультатОбработки.ОбработанУспешно = Истина;
			
		КонецЕсли;
		
	Исключение
		
		РезультатОбработки.Комментарий = "Ошибка: " + ОписаниеОшибки();
		
	КонецПопытки;
	
	Возврат РезультатОбработки;
	
КонецФункции

Функция ЭтоИзображениеИлиPDF(Расширение) Экспорт
		
	// Проверяем, является ли файл изображением или PDF файлом
	МассивДопустимыхРасширений = Новый Массив;
	МассивДопустимыхРасширений.Добавить(".jpg");
	МассивДопустимыхРасширений.Добавить(".jpeg");
	МассивДопустимыхРасширений.Добавить(".png");
	МассивДопустимыхРасширений.Добавить(".pdf");
	
	Возврат МассивДопустимыхРасширений.Найти(Расширение) <> Неопределено;
	
КонецФункции

Функция ПолучитьХешСуммуФайла(Знач ПолноеИмяФайла) Экспорт
	
	НужноУдалитьФайл = Ложь;
	
	Если ЭтоАдресВременногоХранилища(ПолноеИмяФайла) Тогда
		
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(ПолноеИмяФайла);
		ДвоичныеДанные.Записать(ИмяВременногоФайла);
		ПолноеИмяФайла = ИмяВременногоФайла;
		
		НужноУдалитьФайл = Истина;
		
	КонецЕсли;
	
	Хеш = Новый ХешированиеДанных(ХешФункция.MD5);
	Хеш.ДобавитьФайл(ПолноеИмяФайла);
	ХешСумма = Строка(Хеш.ХешСумма);
	
	Если НужноУдалитьФайл Тогда
		УдалитьФайлы(ИмяВременногоФайла);
	КонецЕсли;
	
	Возврат ХешСумма;
	
КонецФункции

#КонецОбласти
