
#Область ПрограммныйИнтерфейс

Функция КонкурентнаяРазведкаN8N(МассивНоменклатуры, СписокСайтовДляАнализа) Экспорт
	
	РезультатОбработки = Новый Структура;
	РезультатОбработки.Вставить("РезультатПолучен", Ложь);
	РезультатОбработки.Вставить("Результат", Новый Массив);
	РезультатОбработки.Вставить("Комментарий", "");
	    
	// Определение нужного микросервиса и запроса к N8N
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("model", "competitors");
	СтруктураДанных.Вставить("competitors", СписокСайтовДляАнализа);
	СтруктураДанных.Вставить("variants", МассивНоменклатуры);
	  
	
	Попытка

		Результат = ПС_КоннекторHTTP.PostJSON(АдресМикросервиса("Распознавание"), СтруктураДанных, 
		Новый Структура("Аутентификация,Заголовки,Таймаут", Аутентификация_N8N(), Заголовки_N8N(), 120));
	
		ЕстьДанные = Ложь;
		
		РезультатОбработки.Результат = ПС_ИндексацияФайловВызовСервера.JSONВСтруктуру(Результат["output"]);
		ЕстьДанные = Истина;
				
		Если ЕстьДанные Тогда
			

			РезультатОбработки.РезультатПолучен = Истина;
			
		КонецЕсли;
		
	Исключение
		
		РезультатОбработки.Комментарий = "Ошибка: " + ОписаниеОшибки();
		
	КонецПопытки;
	
	Возврат РезультатОбработки;
	
КонецФункции

// Выполняет распознавание документа N8N
// 
// Параметры:
//  ДДСкана - ДвоичныеДанные - двоичные данные скана
// 
// Возвращаемое значение:
//  Структура - результат распознавания:
//   * ОбработанУспешно - Булево - признак успешного выполнения распознавания
//   * Комментарий - Строка - комментарий в случае ошибки
//   * РаспознанныеДанные - Структура - данные распознанного документа
//   * КлючевыеРеквизиты - Структура - ключевые реквизиты распознанного документа
Функция РаспознатьДокументN8N(ДДСкана) Экспорт
	
	РезультатОбработки = Новый Структура;
	РезультатОбработки.Вставить("ОбработанУспешно", Ложь);
	РезультатОбработки.Вставить("Комментарий", "");
	РезультатОбработки.Вставить("РаспознанныеДанные", Новый Структура);
	РезультатОбработки.Вставить("КлючевыеРеквизиты", Новый Структура);
	
	ДД_64 = Base64Строка(ДДСкана);
		    
	// Определение структуры
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("model", "mistral");
	    
	Сообщения = Новый Массив;
	    
		СообщениеСистемы = Новый Структура;
		СообщениеСистемы.Вставить("document_base64", ДД_64);
	
	Сообщения.Add(СообщениеСистемы);
	    
	СтруктураДанных.Вставить("messages", Сообщения);
	
	Попытка

		Результат = ПС_КоннекторHTTP.PostJSON(АдресМикросервиса("Распознавание"), СтруктураДанных, 
		Новый Структура("Аутентификация,Заголовки,Таймаут", Аутентификация_N8N(), Заголовки_N8N(), 120));
	
		ЕстьДанные = Ложь;

		Для каждого ТекЭлемент Из Результат["output"] Цикл
		
			РезультатОбработки.РаспознанныеДанные.Вставить(ТекЭлемент.Ключ, ТекЭлемент.Значение);	
			
			Если ПС_ИндексацияФайловВызовСервера.ЭтоКлючевойРеквизит(ТекЭлемент.Ключ) Тогда
			
				РезультатОбработки.КлючевыеРеквизиты.Вставить(ТекЭлемент.Ключ, ТекЭлемент.Значение);
				
			КонецЕсли;
			
			ЕстьДанные = Истина;
	
		КонецЦикла;	
		
		Если ЕстьДанные Тогда
		
			РезультатОбработки.ОбработанУспешно = Истина;
			
		КонецЕсли;
		
	Исключение
		
		РезультатОбработки.Комментарий = "Ошибка: " + ОписаниеОшибки();
		
	КонецПопытки;
	
	Возврат РезультатОбработки;
	
КонецФункции

// Функция выполняет поиск документа в сервисе N8N
//
// Параметры:
//  СтруктураКлючевыхРеквизитов - Структура - структура ключевых реквизитов
//  МассивВариантов - Массив из Строка
//
// Возвращаемое значение:
//  Структура - результат обработки
//	
Функция ПоискДокументаN8N(СтруктураКлючевыхРеквизитов, МассивВариантов) Экспорт
	
	РезультатОбработки = Новый Структура;
	РезультатОбработки.Вставить("ОбработанУспешно", Ложь);
	РезультатОбработки.Вставить("Результат", Новый Структура);
	РезультатОбработки.Вставить("Комментарий", "");
	    
	// Определение нужного микросервиса и запроса к N8N
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("model", "search");
	    
	Сообщения = Новый Массив;
		    
		СообщениеСистемы = Новый Структура;
		СообщениеСистемы.Вставить("request", СтруктураКлючевыхРеквизитов);
		СообщениеСистемы.Вставить("variants", МассивВариантов);
		Сообщения.Add(СообщениеСистемы);
	    
	СтруктураДанных.Вставить("messages", Сообщения);
	
	Попытка

		Результат = ПС_КоннекторHTTP.PostJSON(АдресМикросервиса("Распознавание"), СтруктураДанных, 
		Новый Структура("Аутентификация,Заголовки,Таймаут", Аутентификация_N8N(), Заголовки_N8N(), 120));
	
		ЕстьДанные = Ложь;

		Для каждого ТекЭлемент Из Результат["output"] Цикл
		
			РезультатОбработки.Результат.Вставить(ТекЭлемент.Ключ, ТекЭлемент.Значение);
			
			ЕстьДанные = Истина;
	
		КонецЦикла;	
		
		Если ЕстьДанные Тогда
			
			РезультатОбработки.Результат.accuracy = ПС_СлужебныеФункцииВызовСервера.Число2(РезультатОбработки.Результат.accuracy);
			РезультатОбработки.Результат.date = XMLЗначение(Тип("Дата"), СтруктураКлючевыхРеквизитов.date);
		
			РезультатОбработки.ОбработанУспешно = Истина;
			
		КонецЕсли;
		
	Исключение
		
		РезультатОбработки.Комментарий = "Ошибка: " + ОписаниеОшибки();
		
	КонецПопытки;
	
	Возврат РезультатОбработки;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция Аутентификация_N8N()

	Логин = Справочники.ПС_НастройкиРаспознавания.ПараметрРаспознавания("ЛогинN8N");
	Пароль = Справочники.ПС_НастройкиРаспознавания.ПараметрРаспознавания("ПарольN8N");

	Аутентификация = ПС_КоннекторHTTP.НоваяАутентификацияBasic(Логин, Пароль);
	    
	Возврат Аутентификация;
	
КонецФункции

Функция Заголовки_N8N()
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("x-client-id", "");
	
	Возврат Заголовки;
	
КонецФункции

Функция АдресМикросервиса(ИмяМикросервиса)
	
	Если Справочники.ПС_НастройкиРаспознавания.ПараметрРаспознавания("РежимТестированияСервиса") = Истина Тогда
		
		Возврат Справочники.ПС_НастройкиРаспознавания.ПараметрРаспознавания("АдресТестовогоКонтураСервиса");
		
	Иначе
	
		Если ИмяМикросервиса = "Распознавание" Тогда
			
			Возврат Справочники.ПС_НастройкиРаспознавания.ПараметрРаспознавания("АдресСервисаРаспознаванияДокументов");
			
		Иначе
			
			ВызватьИсключение "Сервис не поддерживается";
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти
