
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
// Возвращает значение параметра распознавания
//
// Параметры:
//  ИмяПараметра - Строка - Имя параметра распознавания
//
// Возвращаемое значение:
//  Строка - Значение параметра распознавания
Функция ПараметрРаспознавания(ИмяПараметра) Экспорт
	
		ЭлементНастроек = Справочники.ПС_НастройкиРаспознавания[ИмяПараметра];
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ПС_НастройкиРаспознавания.Ссылка,
		               |	ПС_НастройкиРаспознавания.Пароль,
		               |	ПС_НастройкиРаспознавания.Значение
		               |ИЗ
		               |	Справочник.ПС_НастройкиРаспознавания КАК ПС_НастройкиРаспознавания
		               |ГДЕ
		               |	ПС_НастройкиРаспознавания.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", ЭлементНастроек);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			ЭлементНастроек = Выборка;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ЭлементНастроек.Пароль) Тогда
			
			Возврат ЭлементНастроек.Пароль;
			
		ИначеЕсли ЗначениеЗаполнено(ЭлементНастроек.Значение) Тогда
			
			Возврат ЭлементНастроек.Значение;
			
		Иначе
			
			Возврат Неопределено;
			
		КонецЕсли;
		
	КонецФункции

#КонецОбласти

//#Область ОбработчикиСобытий
//
//// Код процедур и функций
//
//#КонецОбласти
//
//#Область СлужебныйПрограммныйИнтерфейс
//
//// Код процедур и функций
//
//#КонецОбласти
//
//#Область СлужебныеПроцедурыИФункции
//
//// Код процедур и функций
//
//#КонецОбласти

#КонецЕсли
