
#Область ПрограммныйИнтерфейс

// Процедура предназначена для вывода сообщения пользователю.
//
// Параметры:
//  ТекстСообщения - Строка - текст сообщения.
//
Процедура СообщитьПользователю(ТекстСообщения) Экспорт
	
	СообщениеПользователю = Новый СообщениеПользователю;
	СообщениеПользователю.Текст = ТекстСообщения;
	СообщениеПользователю.Сообщить();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
