#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПроверитьКаталоги(Команда)
	
	ПС_ИндексацияФайловКлиент.ПроверитьКаталогиСФайлами();
	ПС_ИндексацияФайловВызовСервера.ПроверитьКаталогиСФайлами();
	
	Элементы.Список.Обновить();
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработатьВыбранныйФайл(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Состояние("Выполняется обработка документа");
	ПС_ИндексацияФайловКлиент.ОбработатьДокумент(ТекущиеДанные.ХешСумма);
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти