
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ОбработкаОжиданияЗагрузкиФайла", 0.2, Истина);
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОжиданияЗагрузкиФайла()
	
	Если ЗначениеЗаполнено(ВыбДокумент) Тогда
		
		МассивФайлов = Новый Массив;
		МассивФайлов.Добавить(ИмяФайла);
			
		ПС_ОбработкаКоммандКлиент.ПослеВыбораФайлаДляЗагрузки(МассивФайлов, ВыбДокумент, Ложь);
		Закрыть();
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Документ") Тогда
		
		ВыбДокумент = Параметры.Документ;
		ИмяФайла = Параметры.ИмяФайла;
		
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти
