
#Область ПрограммныйИнтерфейс

Процедура ДополнитьИдентификаторыПоНоменклатуре(СсылкаНаНоменклатуру, ДополнительныеИдентификаторы) Экспорт
	
	ЗапросДопИнформации = Новый Запрос;
	ЗапросДопИнформации.Текст = 
	"ВЫБРАТЬ
	|	ПС_НастройкиКонкурентногоАнализаСписокНастроек.Наименование КАК Наименование,
	|	ПС_НастройкиКонкурентногоАнализаСписокНастроек.Значение КАК Значение,
	|	ПС_НастройкиКонкурентногоАнализаСписокНастроек.АлгоритмПолучения КАК АлгоритмПолучения
	|ИЗ
	|	Справочник.ПС_НастройкиКонкурентногоАнализа.СписокНастроек КАК ПС_НастройкиКонкурентногоАнализаСписокНастроек
	|ГДЕ
	|	ПС_НастройкиКонкурентногоАнализаСписокНастроек.Ссылка = &Ссылка";
	
	ЗапросДопИнформации.УстановитьПараметр("Ссылка", Справочники.ПС_НастройкиКонкурентногоАнализа.ДопИдентификаторыНоменклатуры);
	
	ВыборкаДопИнформации = ЗапросДопИнформации.Выполнить().Выбрать();
	
	Пока ВыборкаДопИнформации.Следующий() Цикл
		
		Если ВыборкаДопИнформации.АлгоритмПолучения = Перечисления.ПС_АлгоритмыПолученияДопИнформации.ОбычныйРеквизит Тогда
			
			Попытка
				
				СтруктураДопИнформации = Новый Соответствие;
				СтруктураДопИнформации.Вставить(ВыборкаДопИнформации.Наименование, ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаНоменклатуру, ВыборкаДопИнформации.Значение));
					
				ДополнительныеИдентификаторы.Добавить(СтруктураДопИнформации);					
						
			Исключение
						
				СообщениеПользователю = Новый СообщениеПользователю;
				СообщениеПользователю.Текст = "Не удалось получить реквизит по номенклатуре: " + СсылкаНаНоменклатуру + " по причине: " + ОписаниеОшибки();
				СообщениеПользователю.Сообщить();						
										
			КонецПопытки;
			
		ИначеЕсли ВыборкаДопИнформации.АлгоритмПолучения = Перечисления.ПС_АлгоритмыПолученияДопИнформации.ДопРеквизитБСП Тогда
			
			Попытка
				
				СтруктураДопИнформации = Новый Соответствие;
				СтруктураДопИнформации.Вставить(ВыборкаДопИнформации.Наименование, УправлениеСвойствами.ЗначениеСвойства(СсылкаНаНоменклатуру, ВыборкаДопИнформации.Значение));
					
				ДополнительныеИдентификаторы.Добавить(СтруктураДопИнформации);					
						
			Исключение
						
				СообщениеПользователю = Новый СообщениеПользователю;
				СообщениеПользователю.Текст = "Не удалось получить доп. реквизит БСП по номенклатуре: " + СсылкаНаНоменклатуру + " по причине: " + ОписаниеОшибки();
				СообщениеПользователю.Сообщить();						
										
			КонецПопытки; 
			
		ИначеЕсли ВыборкаДопИнформации.АлгоритмПолучения = Перечисления.ПС_АлгоритмыПолученияДопИнформации.ФиксированноеЗначение Тогда
				
				СтруктураДопИнформации = Новый Соответствие;
				СтруктураДопИнформации.Вставить(ВыборкаДопИнформации.Наименование, ВыборкаДопИнформации.Значение);
					
				ДополнительныеИдентификаторы.Добавить(СтруктураДопИнформации);	
				
		ИначеЕсли ВыборкаДопИнформации.АлгоритмПолучения = Перечисления.ПС_АлгоритмыПолученияДопИнформации.ПроизвольныйКод Тогда
			
			Попытка
				
				Значение = Неопределено;
				
				УстановитьБезопасныйРежим(Истина);
				Выполнить(ВыборкаДопИнформации.Значение);
				УстановитьБезопасныйРежим(Ложь);
				
				СтруктураДопИнформации = Новый Соответствие;
				СтруктураДопИнформации.Вставить(ВыборкаДопИнформации.Наименование, Значение);
					
				ДополнительныеИдентификаторы.Добавить(СтруктураДопИнформации);					
						
			Исключение
						
				СообщениеПользователю = Новый СообщениеПользователю;
				СообщениеПользователю.Текст = "Не удалось выполнить произвольный код по номенклатуры: " + СсылкаНаНоменклатуру + " по причине: " + ОписаниеОшибки();
				СообщениеПользователю.Сообщить();						
										
			КонецПопытки; 								
							
		КонецЕсли;
		
	КонецЦикла;
	
	//В разных конфигурациях данные могут храниться в доп. регистрах, доп. реквизитах и т.д.
	
	МодульПолученияДопДанных = Неопределено;
	
	Если СтрНайти(ВРег(Метаданные.Имя), "ТОРГОВЛЕЙ") > 0 Тогда
		
		УстановитьБезопасныйРежим(Истина);
		МодульПолученияДопДанных = Вычислить("ПС_ПолучениеДанныхУправлениеТорговлей");
		УстановитьБезопасныйРежим(Ложь);
		
	ИначеЕсли СтрНайти(ВРег(Метаданные.Имя), "БУХГАЛТЕРИЯ") > 0 Тогда
		
		УстановитьБезопасныйРежим(Истина);
		МодульПолученияДопДанных = Вычислить("ПС_ПолучениеДанныхБухгалтерияПредприятия");
		УстановитьБезопасныйРежим(Ложь);
		
	КонецЕсли;
	
	Если МодульПолученияДопДанных <> Неопределено Тогда
		
		МодульПолученияДопДанных.ПолучитьДопИдентификаторыПоНоменклатуре(СсылкаНаНоменклатуру, ДополнительныеИдентификаторы);
		
	Иначе
		
		Возврат;
		
	КонецЕсли;

КонецПроцедуры

Функция СписокСайтовДляКонкурентногоАнализа() Экспорт
	
	ЗапросДопИнформации = Новый Запрос;
	ЗапросДопИнформации.Текст = 
	"ВЫБРАТЬ
	|	ПС_НастройкиКонкурентногоАнализаСписокНастроек.Наименование КАК Наименование,
	|	ПС_НастройкиКонкурентногоАнализаСписокНастроек.Значение КАК Значение,
	|	ПС_НастройкиКонкурентногоАнализаСписокНастроек.АлгоритмПолучения КАК АлгоритмПолучения
	|ИЗ
	|	Справочник.ПС_НастройкиКонкурентногоАнализа.СписокНастроек КАК ПС_НастройкиКонкурентногоАнализаСписокНастроек
	|ГДЕ
	|	ПС_НастройкиКонкурентногоАнализаСписокНастроек.Ссылка = &Ссылка";
	
	ЗапросДопИнформации.УстановитьПараметр("Ссылка", Справочники.ПС_НастройкиКонкурентногоАнализа.СайтыКонкурентов);
	
	ВыборкаДопИнформации = ЗапросДопИнформации.Выполнить().Выбрать();
	
	СайтыКонкурентов = Новый Массив;	
	
	Пока ВыборкаДопИнформации.Следующий() Цикл
			
		//TODO: Предусмотреть динамическое получение по произвольному алгоритму или из доп. реквизита какой-то ссылки, например, номенклатуры			
		СтруктураДопИнформации = Новый Соответствие;
		СтруктураДопИнформации.Вставить(ВыборкаДопИнформации.Наименование, ВыборкаДопИнформации.Значение);	
		СайтыКонкурентов.Добавить(СтруктураДопИнформации);			
				
	КонецЦикла;
	
	Возврат СайтыКонкурентов;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
