
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Сформировать отчет в фоновом режиме
//
// Параметры:
//  АдресРезультата - Строка - адрес временного хранилища для размещения результата
//  АдресТоваров - Строка - адрес временного хранилища с данными товаров для анализа
//  ИДФормы - УникальныйИдентификатор - уникальный идентификатор формы
Функция СформироватьОтчетВФоне(ТаблицаТоваров, ИДФормы) Экспорт
	
		
	Результат = Новый Структура;
	Результат.Вставить("Результат", Новый ТабличныйДокумент);
	Результат.Вставить("ДанныеРасшифровки", Неопределено);
	Результат.Вставить("Успех", Истина);
		
	ОтчетОбъект = Отчеты.ПС_КонкурентнаяРазведка.Создать();
	ОтчетОбъект.ВывестиОтчет(Результат.Результат, ТаблицаТоваров, Результат.ДанныеРасшифровки, ИДФормы);
	
	Возврат Результат;
		
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
