
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Выводит отчет в табличный документ.
//
// Параметры:
//  ТабличныйДокумент - ТабличныйДокумент - документ, в который выводится отчет.
Процедура ВывестиОтчет(ТабличныйДокумент, ТаблицаТоваров,ДанныеРасшифровкиАдрес = Неопределено, ИДФормы) Экспорт
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;   
	
	ТаблицаДанных = СформироватьТаблицуДанных(ТаблицаТоваров);
	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("ТаблицаДанных", ТаблицаДанных);
		
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.ПолучитьНастройки(),ДанныеРасшифровки);
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,ВнешниеНаборыДанных,ДанныеРасшифровки);	
			
    ТабличныйДокумент.Очистить();
		
	// Инициализируем процессор вывода
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;	
	ПроцессорВывода.УстановитьДокумент(ТабличныйДокумент);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
											
	ДанныеРасшифровкиАдрес = ПоместитьВоВременноеХранилище(ДанныеРасшифровки, ИДФормы);
										
														
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьТаблицуДанных(ТаблицаТоваров)
	
	ОписаниеТипаСтрока = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(1000));
	ОписаниеТипаЧисло = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2));
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаДанных.Колонки.Добавить("Конкурент", ОписаниеТипаСтрока);
	ТаблицаДанных.Колонки.Добавить("НашаЦена", ОписаниеТипаЧисло);
	ТаблицаДанных.Колонки.Добавить("Цена", ОписаниеТипаЧисло);
	ТаблицаДанных.Колонки.Добавить("Наличие", ОписаниеТипаЧисло);
	ТаблицаДанных.Колонки.Добавить("СсылкаНаСайт", ОписаниеТипаСтрока);
	
	Для каждого СтрокаТЧ Из ТаблицаТоваров Цикл
		
		НоваяСтрока = ТаблицаДанных.Добавить();
		НоваяСтрока.Номенклатура 	= СтрокаТЧ.Номенклатура;
		НоваяСтрока.НашаЦена 		= СтрокаТЧ.Цена;
		
	КонецЦикла;
	
	Возврат ТаблицаДанных;

КонецФункции

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
