
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Выводит отчет в табличный документ.
//
// Параметры:
//  ТабличныйДокумент - ТабличныйДокумент - документ, в который выводится отчет.
Процедура ВывестиОтчет(ТабличныйДокумент, ТаблицаТоваров,ДанныеРасшифровкиАдрес = Неопределено, ИДФормы) Экспорт
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;   
	
	ТаблицаДанных = СформироватьТаблицуДанных(ТаблицаТоваров);
	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("ТаблицаДанных", ТаблицаДанных);
		
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.ПолучитьНастройки(),ДанныеРасшифровки);
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,ВнешниеНаборыДанных,ДанныеРасшифровки);	
			
    ТабличныйДокумент.Очистить();
		
	// Инициализируем процессор вывода
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;	
	ПроцессорВывода.УстановитьДокумент(ТабличныйДокумент);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
											
	ДанныеРасшифровкиАдрес = ПоместитьВоВременноеХранилище(ДанныеРасшифровки, ИДФормы);
										
														
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьТаблицуДанных(ТаблицаТоваров)
	
	ОписаниеТипаСтрока = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(1000));
	ОписаниеТипаЧисло = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2));
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаДанных.Колонки.Добавить("Конкурент", ОписаниеТипаСтрока);
	ТаблицаДанных.Колонки.Добавить("НашаЦена", ОписаниеТипаЧисло);
	ТаблицаДанных.Колонки.Добавить("Цена", ОписаниеТипаЧисло);
	ТаблицаДанных.Колонки.Добавить("Наличие", ОписаниеТипаЧисло);
	ТаблицаДанных.Колонки.Добавить("СсылкаНаСайт", ОписаниеТипаСтрока);
	
	ДанныеИИ = ПолучитьДанныеКонкурентногоАнализаИИ(ТаблицаТоваров);
	
	//TODO: интерпритация данных и связка с исходными данными
	
	Для каждого СтрокаТЧ Из ТаблицаТоваров Цикл
		
		НоваяСтрока = ТаблицаДанных.Добавить();
		НоваяСтрока.Номенклатура 	= СтрокаТЧ.Номенклатура;
		НоваяСтрока.НашаЦена 		= СтрокаТЧ.Цена;
		
	КонецЦикла;
	
	Возврат ТаблицаДанных;

КонецФункции

Функция ПолучитьДанныеКонкурентногоАнализаИИ(ТаблицаТоваров)
	
	ЗапросДанныеНоменклатуры = Новый Запрос;
	ЗапросДанныеНоменклатуры.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка,
	|	Номенклатура.НаименованиеПолное КАК НаименованиеПолное,
	|	Номенклатура.Артикул КАК Артикул,
	|	Номенклатура.Код КАК Код
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В (&Ссылка)";
	
	ЗапросДанныеНоменклатуры.Параметры.Вставить("Ссылка", ТаблицаТоваров.ВыгрузитьКолонку("Номенклатура"));
	
	РезультатЗапроса = ЗапросДанныеНоменклатуры.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МассивДанных = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтруктураДанных = Новый Структура;
		
		СтруктураДанных.Вставить("Наименование", ВыборкаДетальныеЗаписи.НаименованиеПолное);
		СтруктураДанных.Вставить("Артикул", ВыборкаДетальныеЗаписи.Артикул);
		СтруктураДанных.Вставить("Код", ВыборкаДетальныеЗаписи.Код); //Будем использовать для иденцификации после поиска ИИ
		
		ДополнительныеИдентификаторы = Новый Массив;
		ПС_ПолучениеДанныхВызовСервера.ДополнитьИдентификаторыПоНоменклатуре(ВыборкаДетальныеЗаписи.Ссылка, ДополнительныеИдентификаторы);
		
		СтруктураДанных.Вставить("ДополнительныеИдентификаторы", ДополнительныеИдентификаторы);
		
		МассивДанных.Добавить(СтруктураДанных);
	
	КонецЦикла;
	
	Возврат ПС_N8NВызовСервера.КонкурентнаяРазведкаN8N(МассивДанных, ПС_ПолучениеДанныхВызовСервера.СписокСайтовДляКонкурентногоАнализа());
	
КонецФункции

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
