
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Выводит отчет в табличный документ.
//
// Параметры:
//  ТабличныйДокумент - ТабличныйДокумент - документ, в который выводится отчет.
Процедура ВывестиОтчет(ТабличныйДокумент, ТаблицаТоваров,ДанныеРасшифровкиАдрес = Неопределено, ИДФормы) Экспорт
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;   
	
	ТаблицаДанных = СформироватьТаблицуДанных(ТаблицаТоваров);
	
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("ТаблицаДанных", ТаблицаДанных);
		
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.ПолучитьНастройки(),ДанныеРасшифровки);
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,ВнешниеНаборыДанных,ДанныеРасшифровки);	
			
    ТабличныйДокумент.Очистить();
		
	// Инициализируем процессор вывода
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;	
	ПроцессорВывода.УстановитьДокумент(ТабличныйДокумент);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
											
	ДанныеРасшифровкиАдрес = ПоместитьВоВременноеХранилище(ДанныеРасшифровки, ИДФормы);
										
														
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьТаблицуДанных(ТаблицаТоваров)
	
	ОписаниеТипаСтрока = Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(1000));
	ОписаниеТипаЧисло = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2));
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	ТаблицаДанных.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаДанных.Колонки.Добавить("Конкурент", ОписаниеТипаСтрока);
	ТаблицаДанных.Колонки.Добавить("НашаЦена", ОписаниеТипаЧисло);
	ТаблицаДанных.Колонки.Добавить("Цена", ОписаниеТипаЧисло);
	ТаблицаДанных.Колонки.Добавить("Наличие", ОписаниеТипаЧисло);
	ТаблицаДанных.Колонки.Добавить("СсылкаНаСайт", ОписаниеТипаСтрока);
	ТаблицаДанных.Колонки.Добавить("ТочностьПоиска", ОписаниеТипаЧисло);
	ТаблицаДанных.Колонки.Добавить("Валюта", ОписаниеТипаСтрока);
	ТаблицаДанных.Колонки.Добавить("Единица", ОписаниеТипаСтрока);
	ТаблицаДанных.Колонки.Добавить("НаличиеПодробно", ОписаниеТипаСтрока);
	
	ДанныеИИ = ПолучитьДанныеКонкурентногоАнализаИИ(ТаблицаТоваров);
	
	Если ДанныеИИ.РезультатПолучен Тогда
	
		Для каждого СтрокаТЧ Из ТаблицаТоваров Цикл
			
			КодНоменклатуры = СтрокаТЧ.Номенклатура.Код;
		
			НайденоХотяБыОдно = Ложь;
		
			Для каждого ТекТовар Из ДанныеИИ.Результат Цикл
				
				Если ТекТовар.Code = КодНоменклатуры Тогда
					
					Для каждого ТекКонкурент Из ТекТовар.variants Цикл
					
						НоваяСтрока = ТаблицаДанных.Добавить();
						НоваяСтрока.Номенклатура 	= СтрокаТЧ.Номенклатура;
						НоваяСтрока.НашаЦена 		= СтрокаТЧ.Цена;
					
						НоваяСтрока.Конкурент 		= ТекКонкурент.competitor;
						НоваяСтрока.Цена 			= ТекКонкурент.price;
						НоваяСтрока.Наличие 		= ТекКонкурент.Stock;
						НоваяСтрока.СсылкаНаСайт 	= ТекКонкурент.link;
						
						НоваяСтрока.НаличиеПодробно = ТекКонкурент.StockInfo;
						НоваяСтрока.ТочностьПоиска 	= ТекКонкурент.accuracy;
						НоваяСтрока.Валюта 			= ТекКонкурент.currency;
						НоваяСтрока.Единица 		= ТекКонкурент.StockUnit;
					
						НайденоХотяБыОдно = Истина;
					
					КонецЦикла;
					
				КонецЕсли;
				
				Если НЕ НайденоХотяБыОдно Тогда
											
					НоваяСтрока = ТаблицаДанных.Добавить();
					НоваяСтрока.Номенклатура 	= СтрокаТЧ.Номенклатура;
					НоваяСтрока.НашаЦена 		= СтрокаТЧ.Цена;
					НоваяСтрока.НаличиеПодробно = "Не найдено у конкурентов";
						
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
	
	Иначе
		
		Если ПС_ИндексацияФайловВызовСервера.ПолучитьНастройкуРаспознавания("РежимТестированияСервиса") = Истина Тогда
			
			ПС_ОбщегоНазначенияВызовСервера.СообщитьПользователю(ДанныеИИ.Комментарий);
			
		Иначе
			
			ПС_ОбщегоНазначенияВызовСервера.СообщитьПользователю("Не удалось выполнить запрос к ИИ, обратитесь к администратору");
			
		КонецЕсли;
	
	КонецЕсли;
	
	Возврат ТаблицаДанных;

КонецФункции

Функция ПолучитьДанныеКонкурентногоАнализаИИ(ТаблицаТоваров)
	
	ЗапросДанныеНоменклатуры = Новый Запрос;
	ЗапросДанныеНоменклатуры.Текст = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Ссылка,
	|	Номенклатура.НаименованиеПолное КАК НаименованиеПолное,
	|	Номенклатура.Артикул КАК Артикул,
	|	Номенклатура.Код КАК Код
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В (&Ссылка)";
	
	ЗапросДанныеНоменклатуры.Параметры.Вставить("Ссылка", ТаблицаТоваров.ВыгрузитьКолонку("Номенклатура"));
	
	РезультатЗапроса = ЗапросДанныеНоменклатуры.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МассивДанных = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СтруктураДанных = Новый Структура;
		
		СтруктураДанных.Вставить("Наименование", ВыборкаДетальныеЗаписи.НаименованиеПолное);
		СтруктураДанных.Вставить("Артикул", ВыборкаДетальныеЗаписи.Артикул);
		СтруктураДанных.Вставить("Код", ВыборкаДетальныеЗаписи.Код); //Будем использовать для иденцификации после поиска ИИ
		
		ДополнительныеИдентификаторы = Новый Массив;
		ПС_ПолучениеДанныхВызовСервера.ДополнитьИдентификаторыПоНоменклатуре(ВыборкаДетальныеЗаписи.Ссылка, ДополнительныеИдентификаторы);
		
		СтруктураДанных.Вставить("ДополнительныеИдентификаторы", ДополнительныеИдентификаторы);
		
		МассивДанных.Добавить(СтруктураДанных);
	
	КонецЦикла;
	
	Возврат ПС_N8NВызовСервера.КонкурентнаяРазведкаN8N(МассивДанных, ПС_ПолучениеДанныхВызовСервера.СписокСайтовДляКонкурентногоАнализа());
	
КонецФункции

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
