
#Область ПрограммныйИнтерфейс

Функция Число2(СуммаСтрокой) Экспорт

	СуммаСтрокой = СтрЗаменить(СуммаСтрокой, ",", ".");
	
	Рез = "0";
	
	Для Ы = 1 По СтрДлина(СуммаСтрокой) Цикл
		
		Буква = Сред(СуммаСтрокой, Ы, 1);
		
		Если СтрНайти("0123456789.", Буква) > 0 Тогда
			
			Рез = Рез + Буква;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Попытка
		
		Возврат Число(Рез);
		
	Исключение
	
		Возврат 0;
	
	КонецПопытки;

КонецФункции

#КонецОбласти

//#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

//#КонецОбласти

//#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

//#КонецОбласти
