
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытий
&После("ПриНачалеРаботыСистемы")
Процедура ПС_ПриНачалеРаботыСистемы()
	
	//ОткрыватьСканированиеПриНачалеРаботы
	Если ПС_ИндексацияФайловВызовСервера.ПолучитьНастройкуРаспознавания("ОткрыватьСканированиеПриНачалеРаботы") = Истина Тогда
	
		ОткрытьФорму("РегистрСведений.ПС_ОбработкаДокументов.Форма.ФормаСписка")
		
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область Инициализация

#КонецОбласти
