#Если ТонкийКлиент Тогда
	
#Область ПрограммныйИнтерфейс

// Процедура - Выбор файла для загрузки
// 
// Параметры:
//  ВыбранныйФайлМассив	- Массив из Строка
//  ДополнительныеПараметры - структура
//  ОбновитьДокумент - булево - создать новый или обновить существующий
//
Процедура ПослеВыбораФайлаДляЗагрузки(ВыбранныйФайлМассив, ДополнительныеПараметры, ОбновитьДокумент = Ложь) Экспорт
	
	Если ВыбранныйФайлМассив <> Неопределено Тогда
		
		Если ОбновитьДокумент Тогда
		
			ИДОбъекта = ДополнительныеПараметры;
			
		Иначе
		
			ИДОбъекта = Строка(Новый УникальныйИдентификатор()); //Временный ИД пока объекта нет
			
		КонецЕсли;
		
		ВыбранныйФайл = Новый Файл(ВыбранныйФайлМассив[0]);
			
		ХешСумма = ПС_ИндексацияФайловКлиент.ДобавитьВыбранныйФайлНаКлиентеВРегистр(ВыбранныйФайл.ПолноеИмя, ВыбранныйФайл.Расширение, ИДОбъекта);
		
		Если ХешСумма <> Неопределено Тогда
		
			ПС_ИндексацияФайловКлиент.ОбработатьДокумент(ХешСумма, Истина, ИДОбъекта);
			
			СсылкаНаНовыйДокумент = ПС_СозданиеНовыхОбъектовВызовСервера.СоздатьДокументПоРаспознаннымДанным(ХешСумма, ИДОбъекта, ДополнительныеПараметры, ОбновитьДокумент);
			
			Если ЗначениеЗаполнено(СсылкаНаНовыйДокумент) Тогда
				
				Если СсылкаНаНовыйДокумент <> ИДОбъекта Тогда
				
					ПС_ИндексацияФайловВызовСервера.ПривязатьЗаписьРегистраКСозданномуДокументу(ХешСумма, ИДОбъекта, СсылкаНаНовыйДокумент);
					
				КонецЕсли;
				
				Если НЕ ОбновитьДокумент Тогда
				
					ПоказатьЗначение(,СсылкаНаНовыйДокумент);
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

//#Область СлужебныйПрограммныйИнтерфейс
//
//// Код процедур и функций
//
//#КонецОбласти
//
//#Область СлужебныеПроцедурыИФункции
//
//// Код процедур и функций
//
//#КонецОбласти

#КонецЕсли
