
#Область ПрограммныйИнтерфейс

Процедура ПослеВыбораФайлаДляЗагрузки(ВыбранныйФайлМассив, ДополнительныеПараметры, ОбновитьДокумент = Ложь) Экспорт
	
	Если ВыбранныйФайлМассив <> Неопределено Тогда
		
		Если ОбновитьДокумент Тогда
		
			ИДОбъекта = ДополнительныеПараметры;
			
		Иначе
		
			ИДОбъекта = Строка(Новый УникальныйИдентификатор()); //Временный ИД пока объекта нет
			
		КонецЕсли;
		
		ВыбранныйФайл = Новый Файл(ВыбранныйФайлМассив[0]);
			
		ХешСумма = ПС_ИндексацияФайловКлиент.ДобавитьВыбранныйФайлНаКлиентеВРегистр(ВыбранныйФайл.ПолноеИмя, ВыбранныйФайл.Расширение, ИДОбъекта);
		
		Если ХешСумма <> Неопределено Тогда
		
			ПС_ИндексацияФайловКлиент.ОбработатьДокумент(ХешСумма, Истина, ИДОбъекта);
			
			СсылкаНаНовыйДокумент = ПС_ИндексацияФайловВызовСервера.СоздатьДокументПоРаспознаннымДанным(ХешСумма, ИДОбъекта, ДополнительныеПараметры, ОбновитьДокумент);
			
			Если ЗначениеЗаполнено(СсылкаНаНовыйДокумент) Тогда
				
				Если СсылкаНаНовыйДокумент <> ИДОбъекта Тогда
				
					ПС_ИндексацияФайловВызовСервера.ПривязатьЗаписьРегистраКСозданномуДокументу(ХешСумма, ИДОбъекта, СсылкаНаНовыйДокумент);
					
				КонецЕсли;
				
				Если НЕ ОбновитьДокумент Тогда
				
					ПоказатьЗначение(,СсылкаНаНовыйДокумент);
					
				КонецЕсли;
				
			Иначе
				
				//!!! Надо найти запись в регистре по ИД и удалить, но предусмотреть параметр для неудаления таких регистров
				//По умолчанию пока будем оставлять запись
				//Идея: добавить мастер начала работы, где по шагам проходишь и выбираешь нужные параметры
				//Идея2: из 1с отправлять заявку нам на создание бота+n8n для подключения в этой программе
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
